{"loss": "binary_crossentropy", "optimizer": {"beta_1": 0.8999999761581421, "epsilon": 1e-08, "beta_2": 0.9990000128746033, "lr": 0.0010000000474974513, "name": "Adam"}, "class_name": "Model", "loss_weights": [1.0, 0.01], "keras_version": "1.0.4", "config": {"layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1, 128, 128], "name": "input_2", "input_dtype": "float32"}, "inbound_nodes": [], "name": "input_2"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_18", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 16, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["input_2", 0, 0]]], "name": "convolution2d_18"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": true, "name": "leakyrelu_20"}, "inbound_nodes": [[["convolution2d_18", 0, 0]]], "name": "leakyrelu_20"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_19", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 16, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["leakyrelu_20", 0, 0]]], "name": "convolution2d_19"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": true, "name": "leakyrelu_21"}, "inbound_nodes": [[["convolution2d_19", 0, 0]]], "name": "leakyrelu_21"}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_6", "trainable": true, "dim_ordering": "th", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "same"}, "inbound_nodes": [[["leakyrelu_21", 0, 0]]], "name": "maxpooling2d_6"}, {"class_name": "Dropout", "config": {"p": 0.25, "trainable": true, "name": "pool1"}, "inbound_nodes": [[["maxpooling2d_6", 0, 0]]], "name": "pool1"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_20", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 16, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["pool1", 0, 0]]], "name": "convolution2d_20"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": true, "name": "leakyrelu_22"}, "inbound_nodes": [[["convolution2d_20", 0, 0]]], "name": "leakyrelu_22"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_21", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 16, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["leakyrelu_22", 0, 0]]], "name": "convolution2d_21"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": true, "name": "leakyrelu_23"}, "inbound_nodes": [[["convolution2d_21", 0, 0]]], "name": "leakyrelu_23"}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_7", "trainable": true, "dim_ordering": "th", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "same"}, "inbound_nodes": [[["leakyrelu_23", 0, 0]]], "name": "maxpooling2d_7"}, {"class_name": "Dropout", "config": {"p": 0.1, "trainable": true, "name": "pool2"}, "inbound_nodes": [[["maxpooling2d_7", 0, 0]]], "name": "pool2"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_22", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 16, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["pool2", 0, 0]]], "name": "convolution2d_22"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": true, "name": "leakyrelu_24"}, "inbound_nodes": [[["convolution2d_22", 0, 0]]], "name": "leakyrelu_24"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_23", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 16, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["leakyrelu_24", 0, 0]]], "name": "convolution2d_23"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": true, "name": "leakyrelu_25"}, "inbound_nodes": [[["convolution2d_23", 0, 0]]], "name": "leakyrelu_25"}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_8", "trainable": true, "dim_ordering": "th", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "same"}, "inbound_nodes": [[["leakyrelu_25", 0, 0]]], "name": "maxpooling2d_8"}, {"class_name": "Dropout", "config": {"p": 0.1, "trainable": true, "name": "pool3"}, "inbound_nodes": [[["maxpooling2d_8", 0, 0]]], "name": "pool3"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_24", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 16, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["pool3", 0, 0]]], "name": "convolution2d_24"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": true, "name": "leakyrelu_26"}, "inbound_nodes": [[["convolution2d_24", 0, 0]]], "name": "leakyrelu_26"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_25", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 16, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["leakyrelu_26", 0, 0]]], "name": "convolution2d_25"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": true, "name": "leakyrelu_27"}, "inbound_nodes": [[["convolution2d_25", 0, 0]]], "name": "leakyrelu_27"}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_9", "trainable": true, "dim_ordering": "th", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}, "inbound_nodes": [[["leakyrelu_27", 0, 0]]], "name": "maxpooling2d_9"}, {"class_name": "Dropout", "config": {"p": 0.1, "trainable": true, "name": "pool4"}, "inbound_nodes": [[["maxpooling2d_9", 0, 0]]], "name": "pool4"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_26", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 16, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["pool4", 0, 0]]], "name": "convolution2d_26"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_28", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 8, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["pool3", 0, 0]]], "name": "convolution2d_28"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_29", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 8, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["pool2", 0, 0]]], "name": "convolution2d_29"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": true, "name": "leakyrelu_28"}, "inbound_nodes": [[["convolution2d_26", 0, 0]]], "name": "leakyrelu_28"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": true, "name": "leakyrelu_32"}, "inbound_nodes": [[["convolution2d_28", 0, 0]]], "name": "leakyrelu_32"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_27", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 16, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["leakyrelu_28", 0, 0]]], "name": "convolution2d_27"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": true, "name": "leakyrelu_33"}, "inbound_nodes": [[["convolution2d_29", 0, 0]]], "name": "leakyrelu_33"}, {"class_name": "UpSampling2D", "config": {"trainable": true, "name": "upsampling2d_4", "size": [2, 2]}, "inbound_nodes": [[["leakyrelu_32", 0, 0]]], "name": "upsampling2d_4"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": true, "name": "leakyrelu_29"}, "inbound_nodes": [[["convolution2d_27", 0, 0]]], "name": "leakyrelu_29"}, {"class_name": "Merge", "config": {"name": "merge_3", "concat_axis": 1, "mode_type": "raw", "dot_axes": [-1, -1], "mode": "sum", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["upsampling2d_4", 0, 0], ["leakyrelu_33", 0, 0]]], "name": "merge_3"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_31", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 8, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["merge_3", 0, 0]]], "name": "convolution2d_31"}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_10", "trainable": true, "dim_ordering": "th", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}, "inbound_nodes": [[["leakyrelu_29", 0, 0]]], "name": "maxpooling2d_10"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_30", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 8, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["pool1", 0, 0]]], "name": "convolution2d_30"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": true, "name": "leakyrelu_35"}, "inbound_nodes": [[["convolution2d_31", 0, 0]]], "name": "leakyrelu_35"}, {"class_name": "Dropout", "config": {"p": 0.1, "trainable": true, "name": "pool5"}, "inbound_nodes": [[["maxpooling2d_10", 0, 0]]], "name": "pool5"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_2"}, "inbound_nodes": [[["pool5", 0, 0]]], "name": "flatten_2"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": true, "name": "leakyrelu_34"}, "inbound_nodes": [[["convolution2d_30", 0, 0]]], "name": "leakyrelu_34"}, {"class_name": "UpSampling2D", "config": {"trainable": true, "name": "upsampling2d_5", "size": [2, 2]}, "inbound_nodes": [[["leakyrelu_35", 0, 0]]], "name": "upsampling2d_5"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_3", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 32}, "inbound_nodes": [[["flatten_2", 0, 0]]], "name": "dense_3"}, {"class_name": "Merge", "config": {"name": "merge_4", "concat_axis": 1, "mode_type": "raw", "dot_axes": [-1, -1], "mode": "sum", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["upsampling2d_5", 0, 0], ["leakyrelu_34", 0, 0]]], "name": "merge_4"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_32", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 8, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["merge_4", 0, 0]]], "name": "convolution2d_32"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": true, "name": "leakyrelu_30"}, "inbound_nodes": [[["dense_3", 0, 0]]], "name": "leakyrelu_30"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_4", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 16}, "inbound_nodes": [[["leakyrelu_30", 0, 0]]], "name": "dense_4"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": true, "name": "leakyrelu_36"}, "inbound_nodes": [[["convolution2d_32", 0, 0]]], "name": "leakyrelu_36"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": true, "name": "leakyrelu_31"}, "inbound_nodes": [[["dense_4", 0, 0]]], "name": "leakyrelu_31"}, {"class_name": "UpSampling2D", "config": {"trainable": true, "name": "upsampling2d_6", "size": [2, 2]}, "inbound_nodes": [[["leakyrelu_36", 0, 0]]], "name": "upsampling2d_6"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "outbin", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "sigmoid", "output_dim": 1}, "inbound_nodes": [[["leakyrelu_31", 0, 0]]], "name": "outbin"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "outmap", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 1, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "sigmoid", "nb_row": 3}, "inbound_nodes": [[["upsampling2d_6", 0, 0]]], "name": "outmap"}], "input_layers": [["input_2", 0, 0]], "output_layers": [["outmap", 0, 0], ["outbin", 0, 0]], "name": "model_2"}, "sample_weight_mode": null}