{"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1, 128, 128], "name": "input_10", "input_dtype": "float32"}, "inbound_nodes": [], "name": "input_10"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_71", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 11, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 16, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 11}, "inbound_nodes": [[["input_10", 0, 0]]], "name": "convolution2d_71"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": true, "name": "leakyrelu_89"}, "inbound_nodes": [[["convolution2d_71", 0, 0]]], "name": "leakyrelu_89"}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_46", "trainable": true, "dim_ordering": "th", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "same"}, "inbound_nodes": [[["leakyrelu_89", 0, 0]]], "name": "maxpooling2d_46"}, {"class_name": "Dropout", "config": {"p": 0.25, "trainable": true, "name": "pool1"}, "inbound_nodes": [[["maxpooling2d_46", 0, 0]]], "name": "pool1"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_72", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 7, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 16, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 7}, "inbound_nodes": [[["pool1", 0, 0]]], "name": "convolution2d_72"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": true, "name": "leakyrelu_90"}, "inbound_nodes": [[["convolution2d_72", 0, 0]]], "name": "leakyrelu_90"}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_47", "trainable": true, "dim_ordering": "th", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "same"}, "inbound_nodes": [[["leakyrelu_90", 0, 0]]], "name": "maxpooling2d_47"}, {"class_name": "Dropout", "config": {"p": 0.25, "trainable": true, "name": "pool2"}, "inbound_nodes": [[["maxpooling2d_47", 0, 0]]], "name": "pool2"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_73", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 5, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 16, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 5}, "inbound_nodes": [[["pool2", 0, 0]]], "name": "convolution2d_73"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": true, "name": "leakyrelu_91"}, "inbound_nodes": [[["convolution2d_73", 0, 0]]], "name": "leakyrelu_91"}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_48", "trainable": true, "dim_ordering": "th", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "same"}, "inbound_nodes": [[["leakyrelu_91", 0, 0]]], "name": "maxpooling2d_48"}, {"class_name": "Dropout", "config": {"p": 0.25, "trainable": true, "name": "pool3"}, "inbound_nodes": [[["maxpooling2d_48", 0, 0]]], "name": "pool3"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_74", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 5, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 16, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 5}, "inbound_nodes": [[["pool3", 0, 0]]], "name": "convolution2d_74"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": true, "name": "leakyrelu_92"}, "inbound_nodes": [[["convolution2d_74", 0, 0]]], "name": "leakyrelu_92"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_76", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 4, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["pool3", 0, 0]]], "name": "convolution2d_76"}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_49", "trainable": true, "dim_ordering": "th", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}, "inbound_nodes": [[["leakyrelu_92", 0, 0]]], "name": "maxpooling2d_49"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": true, "name": "leakyrelu_96"}, "inbound_nodes": [[["convolution2d_76", 0, 0]]], "name": "leakyrelu_96"}, {"class_name": "Dropout", "config": {"p": 0.25, "trainable": true, "name": "pool4"}, "inbound_nodes": [[["maxpooling2d_49", 0, 0]]], "name": "pool4"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_75", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 16, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["pool4", 0, 0]]], "name": "convolution2d_75"}, {"class_name": "UpSampling2D", "config": {"trainable": true, "name": "upsampling2d_26", "size": [2, 2]}, "inbound_nodes": [[["leakyrelu_96", 0, 0]]], "name": "upsampling2d_26"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": true, "name": "leakyrelu_93"}, "inbound_nodes": [[["convolution2d_75", 0, 0]]], "name": "leakyrelu_93"}, {"class_name": "Merge", "config": {"name": "merge_19", "concat_axis": 1, "mode_type": "raw", "dot_axes": [-1, -1], "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["upsampling2d_26", 0, 0], ["pool2", 0, 0]]], "name": "merge_19"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_77", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 4, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["merge_19", 0, 0]]], "name": "convolution2d_77"}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_50", "trainable": true, "dim_ordering": "th", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}, "inbound_nodes": [[["leakyrelu_93", 0, 0]]], "name": "maxpooling2d_50"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": true, "name": "leakyrelu_97"}, "inbound_nodes": [[["convolution2d_77", 0, 0]]], "name": "leakyrelu_97"}, {"class_name": "Dropout", "config": {"p": 0.25, "trainable": true, "name": "pool5"}, "inbound_nodes": [[["maxpooling2d_50", 0, 0]]], "name": "pool5"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_10"}, "inbound_nodes": [[["pool5", 0, 0]]], "name": "flatten_10"}, {"class_name": "UpSampling2D", "config": {"trainable": true, "name": "upsampling2d_27", "size": [2, 2]}, "inbound_nodes": [[["leakyrelu_97", 0, 0]]], "name": "upsampling2d_27"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_19", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 32}, "inbound_nodes": [[["flatten_10", 0, 0]]], "name": "dense_19"}, {"class_name": "Merge", "config": {"name": "merge_20", "concat_axis": 1, "mode_type": "raw", "dot_axes": [-1, -1], "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["upsampling2d_27", 0, 0], ["pool1", 0, 0]]], "name": "merge_20"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_78", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 4, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["merge_20", 0, 0]]], "name": "convolution2d_78"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": true, "name": "leakyrelu_94"}, "inbound_nodes": [[["dense_19", 0, 0]]], "name": "leakyrelu_94"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_20", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 16}, "inbound_nodes": [[["leakyrelu_94", 0, 0]]], "name": "dense_20"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": true, "name": "leakyrelu_98"}, "inbound_nodes": [[["convolution2d_78", 0, 0]]], "name": "leakyrelu_98"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": true, "name": "leakyrelu_95"}, "inbound_nodes": [[["dense_20", 0, 0]]], "name": "leakyrelu_95"}, {"class_name": "UpSampling2D", "config": {"trainable": true, "name": "upsampling2d_28", "size": [2, 2]}, "inbound_nodes": [[["leakyrelu_98", 0, 0]]], "name": "upsampling2d_28"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "outbin", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "sigmoid", "output_dim": 1}, "inbound_nodes": [[["leakyrelu_95", 0, 0]]], "name": "outbin"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "outmap", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 1, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "sigmoid", "nb_row": 3}, "inbound_nodes": [[["upsampling2d_28", 0, 0]]], "name": "outmap"}], "input_layers": [["input_10", 0, 0]], "output_layers": [["outmap", 0, 0], ["outbin", 0, 0]], "name": "model_8"}}