{"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1, 104, 144], "name": "input_16", "input_dtype": "float32"}, "inbound_nodes": [], "name": "input_16"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_138", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 7, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 16, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 7}, "inbound_nodes": [[["input_16", 0, 0]]], "name": "convolution2d_138"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": true, "name": "leakyrelu_166"}, "inbound_nodes": [[["convolution2d_138", 0, 0]]], "name": "leakyrelu_166"}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_65", "trainable": true, "dim_ordering": "th", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "same"}, "inbound_nodes": [[["leakyrelu_166", 0, 0]]], "name": "maxpooling2d_65"}, {"class_name": "Dropout", "config": {"p": 0.25, "trainable": true, "name": "pool1"}, "inbound_nodes": [[["maxpooling2d_65", 0, 0]]], "name": "pool1"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_139", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 5, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 16, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 5}, "inbound_nodes": [[["pool1", 0, 0]]], "name": "convolution2d_139"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": true, "name": "leakyrelu_167"}, "inbound_nodes": [[["convolution2d_139", 0, 0]]], "name": "leakyrelu_167"}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_66", "trainable": true, "dim_ordering": "th", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "same"}, "inbound_nodes": [[["leakyrelu_167", 0, 0]]], "name": "maxpooling2d_66"}, {"class_name": "Dropout", "config": {"p": 0.25, "trainable": true, "name": "pool2"}, "inbound_nodes": [[["maxpooling2d_66", 0, 0]]], "name": "pool2"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_140", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 5, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 16, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 5}, "inbound_nodes": [[["pool2", 0, 0]]], "name": "convolution2d_140"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": true, "name": "leakyrelu_168"}, "inbound_nodes": [[["convolution2d_140", 0, 0]]], "name": "leakyrelu_168"}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_67", "trainable": true, "dim_ordering": "th", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "same"}, "inbound_nodes": [[["leakyrelu_168", 0, 0]]], "name": "maxpooling2d_67"}, {"class_name": "Dropout", "config": {"p": 0.25, "trainable": true, "name": "pool3"}, "inbound_nodes": [[["maxpooling2d_67", 0, 0]]], "name": "pool3"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_141", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 5, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 16, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 5}, "inbound_nodes": [[["pool3", 0, 0]]], "name": "convolution2d_141"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": true, "name": "leakyrelu_169"}, "inbound_nodes": [[["convolution2d_141", 0, 0]]], "name": "leakyrelu_169"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_143", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 16, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["pool3", 0, 0]]], "name": "convolution2d_143"}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_68", "trainable": true, "dim_ordering": "th", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}, "inbound_nodes": [[["leakyrelu_169", 0, 0]]], "name": "maxpooling2d_68"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": true, "name": "leakyrelu_173"}, "inbound_nodes": [[["convolution2d_143", 0, 0]]], "name": "leakyrelu_173"}, {"class_name": "Dropout", "config": {"p": 0.25, "trainable": true, "name": "pool4"}, "inbound_nodes": [[["maxpooling2d_68", 0, 0]]], "name": "pool4"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_142", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 16, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["pool4", 0, 0]]], "name": "convolution2d_142"}, {"class_name": "UpSampling2D", "config": {"trainable": true, "name": "upsampling2d_46", "size": [2, 2]}, "inbound_nodes": [[["leakyrelu_173", 0, 0]]], "name": "upsampling2d_46"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": true, "name": "leakyrelu_170"}, "inbound_nodes": [[["convolution2d_142", 0, 0]]], "name": "leakyrelu_170"}, {"class_name": "Merge", "config": {"name": "merge_31", "concat_axis": -1, "mode_type": "raw", "dot_axes": [-1, -1], "mode": "sum", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["upsampling2d_46", 0, 0], ["pool2", 0, 0]]], "name": "merge_31"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_144", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 16, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["merge_31", 0, 0]]], "name": "convolution2d_144"}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_69", "trainable": true, "dim_ordering": "th", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}, "inbound_nodes": [[["leakyrelu_170", 0, 0]]], "name": "maxpooling2d_69"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": true, "name": "leakyrelu_174"}, "inbound_nodes": [[["convolution2d_144", 0, 0]]], "name": "leakyrelu_174"}, {"class_name": "Dropout", "config": {"p": 0.25, "trainable": true, "name": "pool5"}, "inbound_nodes": [[["maxpooling2d_69", 0, 0]]], "name": "pool5"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_16"}, "inbound_nodes": [[["pool5", 0, 0]]], "name": "flatten_16"}, {"class_name": "UpSampling2D", "config": {"trainable": true, "name": "upsampling2d_47", "size": [2, 2]}, "inbound_nodes": [[["leakyrelu_174", 0, 0]]], "name": "upsampling2d_47"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_32", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 32}, "inbound_nodes": [[["flatten_16", 0, 0]]], "name": "dense_32"}, {"class_name": "Merge", "config": {"name": "merge_32", "concat_axis": -1, "mode_type": "raw", "dot_axes": [-1, -1], "mode": "sum", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["upsampling2d_47", 0, 0], ["pool1", 0, 0]]], "name": "merge_32"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_145", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 16, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["merge_32", 0, 0]]], "name": "convolution2d_145"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": true, "name": "leakyrelu_171"}, "inbound_nodes": [[["dense_32", 0, 0]]], "name": "leakyrelu_171"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_33", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 16}, "inbound_nodes": [[["leakyrelu_171", 0, 0]]], "name": "dense_33"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": true, "name": "leakyrelu_175"}, "inbound_nodes": [[["convolution2d_145", 0, 0]]], "name": "leakyrelu_175"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": true, "name": "leakyrelu_172"}, "inbound_nodes": [[["dense_33", 0, 0]]], "name": "leakyrelu_172"}, {"class_name": "UpSampling2D", "config": {"trainable": true, "name": "upsampling2d_48", "size": [2, 2]}, "inbound_nodes": [[["leakyrelu_175", 0, 0]]], "name": "upsampling2d_48"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "outbin", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "sigmoid", "output_dim": 1}, "inbound_nodes": [[["leakyrelu_172", 0, 0]]], "name": "outbin"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "outmap", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 1, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "sigmoid", "nb_row": 3}, "inbound_nodes": [[["upsampling2d_48", 0, 0]]], "name": "outmap"}], "input_layers": [["input_16", 0, 0]], "output_layers": [["outmap", 0, 0], ["outbin", 0, 0]], "name": "model_16"}}