{"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1, 128, 128], "name": "input_1", "input_dtype": "float32"}, "inbound_nodes": [], "name": "input_1"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_1", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 7, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 16, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 7}, "inbound_nodes": [[["input_1", 0, 0]]], "name": "convolution2d_1"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": true, "name": "leakyrelu_1"}, "inbound_nodes": [[["convolution2d_1", 0, 0]]], "name": "leakyrelu_1"}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_1", "trainable": true, "dim_ordering": "th", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "same"}, "inbound_nodes": [[["leakyrelu_1", 0, 0]]], "name": "maxpooling2d_1"}, {"class_name": "Dropout", "config": {"p": 0.25, "trainable": true, "name": "pool1"}, "inbound_nodes": [[["maxpooling2d_1", 0, 0]]], "name": "pool1"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_2", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 5, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 16, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 5}, "inbound_nodes": [[["pool1", 0, 0]]], "name": "convolution2d_2"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": true, "name": "leakyrelu_2"}, "inbound_nodes": [[["convolution2d_2", 0, 0]]], "name": "leakyrelu_2"}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_2", "trainable": true, "dim_ordering": "th", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "same"}, "inbound_nodes": [[["leakyrelu_2", 0, 0]]], "name": "maxpooling2d_2"}, {"class_name": "Dropout", "config": {"p": 0.25, "trainable": true, "name": "pool2"}, "inbound_nodes": [[["maxpooling2d_2", 0, 0]]], "name": "pool2"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_3", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 5, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 16, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 5}, "inbound_nodes": [[["pool2", 0, 0]]], "name": "convolution2d_3"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": true, "name": "leakyrelu_3"}, "inbound_nodes": [[["convolution2d_3", 0, 0]]], "name": "leakyrelu_3"}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_3", "trainable": true, "dim_ordering": "th", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "same"}, "inbound_nodes": [[["leakyrelu_3", 0, 0]]], "name": "maxpooling2d_3"}, {"class_name": "Dropout", "config": {"p": 0.25, "trainable": true, "name": "pool3"}, "inbound_nodes": [[["maxpooling2d_3", 0, 0]]], "name": "pool3"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_4", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 5, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 16, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 5}, "inbound_nodes": [[["pool3", 0, 0]]], "name": "convolution2d_4"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": true, "name": "leakyrelu_4"}, "inbound_nodes": [[["convolution2d_4", 0, 0]]], "name": "leakyrelu_4"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_6", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 16, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["pool3", 0, 0]]], "name": "convolution2d_6"}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_4", "trainable": true, "dim_ordering": "th", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}, "inbound_nodes": [[["leakyrelu_4", 0, 0]]], "name": "maxpooling2d_4"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": true, "name": "leakyrelu_8"}, "inbound_nodes": [[["convolution2d_6", 0, 0]]], "name": "leakyrelu_8"}, {"class_name": "Dropout", "config": {"p": 0.25, "trainable": true, "name": "pool4"}, "inbound_nodes": [[["maxpooling2d_4", 0, 0]]], "name": "pool4"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_5", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 16, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["pool4", 0, 0]]], "name": "convolution2d_5"}, {"class_name": "UpSampling2D", "config": {"trainable": true, "name": "upsampling2d_1", "size": [2, 2]}, "inbound_nodes": [[["leakyrelu_8", 0, 0]]], "name": "upsampling2d_1"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": true, "name": "leakyrelu_5"}, "inbound_nodes": [[["convolution2d_5", 0, 0]]], "name": "leakyrelu_5"}, {"class_name": "Merge", "config": {"name": "merge_1", "concat_axis": -1, "mode_type": "raw", "dot_axes": [-1, -1], "mode": "sum", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["upsampling2d_1", 0, 0], ["pool2", 0, 0]]], "name": "merge_1"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_7", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 16, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["merge_1", 0, 0]]], "name": "convolution2d_7"}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_5", "trainable": true, "dim_ordering": "th", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}, "inbound_nodes": [[["leakyrelu_5", 0, 0]]], "name": "maxpooling2d_5"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": true, "name": "leakyrelu_9"}, "inbound_nodes": [[["convolution2d_7", 0, 0]]], "name": "leakyrelu_9"}, {"class_name": "Dropout", "config": {"p": 0.25, "trainable": true, "name": "pool5"}, "inbound_nodes": [[["maxpooling2d_5", 0, 0]]], "name": "pool5"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}, "inbound_nodes": [[["pool5", 0, 0]]], "name": "flatten_1"}, {"class_name": "UpSampling2D", "config": {"trainable": true, "name": "upsampling2d_2", "size": [2, 2]}, "inbound_nodes": [[["leakyrelu_9", 0, 0]]], "name": "upsampling2d_2"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_1", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 32}, "inbound_nodes": [[["flatten_1", 0, 0]]], "name": "dense_1"}, {"class_name": "Merge", "config": {"name": "merge_2", "concat_axis": -1, "mode_type": "raw", "dot_axes": [-1, -1], "mode": "sum", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["upsampling2d_2", 0, 0], ["pool1", 0, 0]]], "name": "merge_2"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_8", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 16, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["merge_2", 0, 0]]], "name": "convolution2d_8"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": true, "name": "leakyrelu_6"}, "inbound_nodes": [[["dense_1", 0, 0]]], "name": "leakyrelu_6"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_2", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 16}, "inbound_nodes": [[["leakyrelu_6", 0, 0]]], "name": "dense_2"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": true, "name": "leakyrelu_10"}, "inbound_nodes": [[["convolution2d_8", 0, 0]]], "name": "leakyrelu_10"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": true, "name": "leakyrelu_7"}, "inbound_nodes": [[["dense_2", 0, 0]]], "name": "leakyrelu_7"}, {"class_name": "UpSampling2D", "config": {"trainable": true, "name": "upsampling2d_3", "size": [2, 2]}, "inbound_nodes": [[["leakyrelu_10", 0, 0]]], "name": "upsampling2d_3"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "outbin", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "sigmoid", "output_dim": 1}, "inbound_nodes": [[["leakyrelu_7", 0, 0]]], "name": "outbin"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "outmap", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 1, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "sigmoid", "nb_row": 3}, "inbound_nodes": [[["upsampling2d_3", 0, 0]]], "name": "outmap"}], "input_layers": [["input_1", 0, 0]], "output_layers": [["outmap", 0, 0], ["outbin", 0, 0]], "name": "model_1"}}