{"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1, 128, 128], "name": "input_img", "input_dtype": "float32"}, "inbound_nodes": [], "name": "input_img"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_21", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 32, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "nb_row": 3}, "inbound_nodes": [[["input_img", 0, 0]]], "name": "convolution2d_21"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_22", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 16, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "nb_row": 3}, "inbound_nodes": [[["convolution2d_21", 0, 0]]], "name": "convolution2d_22"}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_6", "trainable": true, "dim_ordering": "th", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}, "inbound_nodes": [[["convolution2d_22", 0, 0]]], "name": "maxpooling2d_6"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_23", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 32, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "nb_row": 3}, "inbound_nodes": [[["maxpooling2d_6", 0, 0]]], "name": "convolution2d_23"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_24", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 16, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "nb_row": 3}, "inbound_nodes": [[["convolution2d_23", 0, 0]]], "name": "convolution2d_24"}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_7", "trainable": true, "dim_ordering": "th", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}, "inbound_nodes": [[["convolution2d_24", 0, 0]]], "name": "maxpooling2d_7"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_25", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 32, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "nb_row": 3}, "inbound_nodes": [[["maxpooling2d_7", 0, 0]]], "name": "convolution2d_25"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_26", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 16, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "nb_row": 3}, "inbound_nodes": [[["convolution2d_25", 0, 0]]], "name": "convolution2d_26"}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_8", "trainable": true, "dim_ordering": "th", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}, "inbound_nodes": [[["convolution2d_26", 0, 0]]], "name": "maxpooling2d_8"}, {"class_name": "BatchNormalization", "config": {"name": "pool3", "epsilon": 1e-06, "trainable": true, "mode": 0, "momentum": 0.9, "axis": 1}, "inbound_nodes": [[["maxpooling2d_8", 0, 0]]], "name": "pool3"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_33", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 8, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "nb_row": 3}, "inbound_nodes": [[["pool3", 0, 0]]], "name": "convolution2d_33"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_34", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 8, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "nb_row": 3}, "inbound_nodes": [[["convolution2d_33", 0, 0]]], "name": "convolution2d_34"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_27", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 32, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "nb_row": 3}, "inbound_nodes": [[["maxpooling2d_8", 0, 0]]], "name": "convolution2d_27"}, {"class_name": "BatchNormalization", "config": {"name": "pool2", "epsilon": 1e-06, "trainable": true, "mode": 0, "momentum": 0.9, "axis": 1}, "inbound_nodes": [[["maxpooling2d_7", 0, 0]]], "name": "pool2"}, {"class_name": "UpSampling2D", "config": {"trainable": true, "name": "upsampling2d_8", "size": [2, 2]}, "inbound_nodes": [[["convolution2d_34", 0, 0]]], "name": "upsampling2d_8"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_28", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 16, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "nb_row": 3}, "inbound_nodes": [[["convolution2d_27", 0, 0]]], "name": "convolution2d_28"}, {"class_name": "Merge", "config": {"name": "merge_7", "concat_axis": 1, "mode_type": "raw", "dot_axes": [-1, -1], "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["upsampling2d_8", 0, 0], ["pool2", 0, 0]]], "name": "merge_7"}, {"class_name": "Dropout", "config": {"p": 0.25, "trainable": true, "name": "dropout_9"}, "inbound_nodes": [[["merge_7", 0, 0]]], "name": "dropout_9"}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_9", "trainable": true, "dim_ordering": "th", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}, "inbound_nodes": [[["convolution2d_28", 0, 0]]], "name": "maxpooling2d_9"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_29", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 32, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "nb_row": 3}, "inbound_nodes": [[["maxpooling2d_9", 0, 0]]], "name": "convolution2d_29"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_35", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 8, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "nb_row": 3}, "inbound_nodes": [[["dropout_9", 0, 0]]], "name": "convolution2d_35"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_30", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 16, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "nb_row": 3}, "inbound_nodes": [[["convolution2d_29", 0, 0]]], "name": "convolution2d_30"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_36", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 8, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "nb_row": 3}, "inbound_nodes": [[["convolution2d_35", 0, 0]]], "name": "convolution2d_36"}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_10", "trainable": true, "dim_ordering": "th", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}, "inbound_nodes": [[["convolution2d_30", 0, 0]]], "name": "maxpooling2d_10"}, {"class_name": "BatchNormalization", "config": {"name": "pool1", "epsilon": 1e-06, "trainable": true, "mode": 0, "momentum": 0.9, "axis": 1}, "inbound_nodes": [[["maxpooling2d_6", 0, 0]]], "name": "pool1"}, {"class_name": "UpSampling2D", "config": {"trainable": true, "name": "upsampling2d_9", "size": [2, 2]}, "inbound_nodes": [[["convolution2d_36", 0, 0]]], "name": "upsampling2d_9"}, {"class_name": "Merge", "config": {"name": "merge_8", "concat_axis": 1, "mode_type": "raw", "dot_axes": [-1, -1], "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["upsampling2d_9", 0, 0], ["pool1", 0, 0]]], "name": "merge_8"}, {"class_name": "BatchNormalization", "config": {"name": "pool5", "epsilon": 1e-06, "trainable": true, "mode": 0, "momentum": 0.9, "axis": 1}, "inbound_nodes": [[["maxpooling2d_10", 0, 0]]], "name": "pool5"}, {"class_name": "Dropout", "config": {"p": 0.25, "trainable": true, "name": "dropout_10"}, "inbound_nodes": [[["merge_8", 0, 0]]], "name": "dropout_10"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "outmap5", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 1, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "sigmoid", "nb_row": 3}, "inbound_nodes": [[["pool5", 0, 0]]], "name": "outmap5"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_37", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 8, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "nb_row": 3}, "inbound_nodes": [[["dropout_10", 0, 0]]], "name": "convolution2d_37"}, {"class_name": "BatchNormalization", "config": {"name": "pool4", "epsilon": 1e-06, "trainable": true, "mode": 0, "momentum": 0.9, "axis": 1}, "inbound_nodes": [[["maxpooling2d_9", 0, 0]]], "name": "pool4"}, {"class_name": "UpSampling2D", "config": {"trainable": true, "name": "upsampling2d_6", "size": [2, 2]}, "inbound_nodes": [[["outmap5", 0, 0]]], "name": "upsampling2d_6"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_38", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 8, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "nb_row": 3}, "inbound_nodes": [[["convolution2d_37", 0, 0]]], "name": "convolution2d_38"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_2"}, "inbound_nodes": [[["pool5", 0, 0]]], "name": "flatten_2"}, {"class_name": "Merge", "config": {"name": "merge_5", "concat_axis": 1, "mode_type": "raw", "dot_axes": [-1, -1], "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["upsampling2d_6", 0, 0], ["pool4", 0, 0]]], "name": "merge_5"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_3", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "relu", "output_dim": 32}, "inbound_nodes": [[["flatten_2", 0, 0]]], "name": "dense_3"}, {"class_name": "Dropout", "config": {"p": 0.25, "trainable": true, "name": "dropout_7"}, "inbound_nodes": [[["merge_5", 0, 0]]], "name": "dropout_7"}, {"class_name": "UpSampling2D", "config": {"trainable": true, "name": "upsampling2d_10", "size": [2, 2]}, "inbound_nodes": [[["convolution2d_38", 0, 0]]], "name": "upsampling2d_10"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_31", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 16, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "nb_row": 3}, "inbound_nodes": [[["dropout_7", 0, 0]]], "name": "convolution2d_31"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_39", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 8, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "nb_row": 3}, "inbound_nodes": [[["upsampling2d_10", 0, 0]]], "name": "convolution2d_39"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_4", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "relu", "output_dim": 16}, "inbound_nodes": [[["dense_3", 0, 0]]], "name": "dense_4"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_32", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 16, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "nb_row": 3}, "inbound_nodes": [[["convolution2d_31", 0, 0]]], "name": "convolution2d_32"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_40", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 8, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "nb_row": 3}, "inbound_nodes": [[["convolution2d_39", 0, 0]]], "name": "convolution2d_40"}, {"class_name": "Dropout", "config": {"p": 0.25, "trainable": true, "name": "dropout_6"}, "inbound_nodes": [[["dense_4", 0, 0]]], "name": "dropout_6"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "outbin", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "sigmoid", "output_dim": 1}, "inbound_nodes": [[["dropout_6", 0, 0]]], "name": "outbin"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "outmap", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 1, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "sigmoid", "nb_row": 3}, "inbound_nodes": [[["convolution2d_40", 0, 0]]], "name": "outmap"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "outmap4", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 1, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "sigmoid", "nb_row": 3}, "inbound_nodes": [[["convolution2d_32", 0, 0]]], "name": "outmap4"}], "input_layers": [["input_img", 0, 0]], "output_layers": [["outmap", 0, 0], ["outmap4", 0, 0], ["outmap5", 0, 0], ["outbin", 0, 0]], "name": "model_2"}}