{"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1, 128, 128], "name": "input_img", "input_dtype": "float32"}, "inbound_nodes": [], "name": "input_img"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_124", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 16, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["input_img", 0, 0]]], "name": "convolution2d_124"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": true, "name": "leakyrelu_33"}, "inbound_nodes": [[["convolution2d_124", 0, 0]]], "name": "leakyrelu_33"}, {"class_name": "MaxPooling2D", "config": {"name": "pool1", "trainable": true, "dim_ordering": "th", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}, "inbound_nodes": [[["leakyrelu_33", 0, 0]]], "name": "pool1"}, {"class_name": "Dropout", "config": {"p": 0.25, "trainable": true, "name": "dropout_50"}, "inbound_nodes": [[["pool1", 0, 0]]], "name": "dropout_50"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_125", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 16, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["dropout_50", 0, 0]]], "name": "convolution2d_125"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": true, "name": "leakyrelu_34"}, "inbound_nodes": [[["convolution2d_125", 0, 0]]], "name": "leakyrelu_34"}, {"class_name": "MaxPooling2D", "config": {"name": "pool2", "trainable": true, "dim_ordering": "th", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}, "inbound_nodes": [[["leakyrelu_34", 0, 0]]], "name": "pool2"}, {"class_name": "Dropout", "config": {"p": 0.25, "trainable": true, "name": "dropout_51"}, "inbound_nodes": [[["pool2", 0, 0]]], "name": "dropout_51"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_126", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 16, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["dropout_51", 0, 0]]], "name": "convolution2d_126"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": true, "name": "leakyrelu_35"}, "inbound_nodes": [[["convolution2d_126", 0, 0]]], "name": "leakyrelu_35"}, {"class_name": "MaxPooling2D", "config": {"name": "pool3", "trainable": true, "dim_ordering": "th", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}, "inbound_nodes": [[["leakyrelu_35", 0, 0]]], "name": "pool3"}, {"class_name": "Dropout", "config": {"p": 0.25, "trainable": true, "name": "dropout_52"}, "inbound_nodes": [[["pool3", 0, 0]]], "name": "dropout_52"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_127", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 16, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["dropout_52", 0, 0]]], "name": "convolution2d_127"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": true, "name": "leakyrelu_36"}, "inbound_nodes": [[["convolution2d_127", 0, 0]]], "name": "leakyrelu_36"}, {"class_name": "MaxPooling2D", "config": {"name": "pool4", "trainable": true, "dim_ordering": "th", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}, "inbound_nodes": [[["leakyrelu_36", 0, 0]]], "name": "pool4"}, {"class_name": "Dropout", "config": {"p": 0.25, "trainable": true, "name": "dropout_53"}, "inbound_nodes": [[["pool4", 0, 0]]], "name": "dropout_53"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_128", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 16, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["dropout_53", 0, 0]]], "name": "convolution2d_128"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": true, "name": "leakyrelu_37"}, "inbound_nodes": [[["convolution2d_128", 0, 0]]], "name": "leakyrelu_37"}, {"class_name": "MaxPooling2D", "config": {"name": "pool5", "trainable": true, "dim_ordering": "th", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}, "inbound_nodes": [[["leakyrelu_37", 0, 0]]], "name": "pool5"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "outmap4", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 1, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "sigmoid", "nb_row": 3}, "inbound_nodes": [[["pool4", 0, 0]]], "name": "outmap4"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "outmap5", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 1, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "sigmoid", "nb_row": 3}, "inbound_nodes": [[["pool5", 0, 0]]], "name": "outmap5"}, {"class_name": "UpSampling2D", "config": {"trainable": true, "name": "upsampling2d_41", "size": [2, 2]}, "inbound_nodes": [[["outmap4", 0, 0]]], "name": "upsampling2d_41"}, {"class_name": "UpSampling2D", "config": {"trainable": true, "name": "upsampling2d_42", "size": [4, 4]}, "inbound_nodes": [[["outmap5", 0, 0]]], "name": "upsampling2d_42"}, {"class_name": "Merge", "config": {"name": "merge_25", "concat_axis": 1, "mode_type": "raw", "dot_axes": [-1, -1], "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["upsampling2d_41", 0, 0], ["upsampling2d_42", 0, 0], ["pool3", 0, 0]]], "name": "merge_25"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_129", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 16, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["merge_25", 0, 0]]], "name": "convolution2d_129"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": true, "name": "leakyrelu_40"}, "inbound_nodes": [[["convolution2d_129", 0, 0]]], "name": "leakyrelu_40"}, {"class_name": "UpSampling2D", "config": {"trainable": true, "name": "upsampling2d_43", "size": [2, 2]}, "inbound_nodes": [[["leakyrelu_40", 0, 0]]], "name": "upsampling2d_43"}, {"class_name": "Merge", "config": {"name": "merge_26", "concat_axis": 1, "mode_type": "raw", "dot_axes": [-1, -1], "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["upsampling2d_43", 0, 0], ["pool2", 0, 0]]], "name": "merge_26"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_130", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 8, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["merge_26", 0, 0]]], "name": "convolution2d_130"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": true, "name": "leakyrelu_41"}, "inbound_nodes": [[["convolution2d_130", 0, 0]]], "name": "leakyrelu_41"}, {"class_name": "UpSampling2D", "config": {"trainable": true, "name": "upsampling2d_44", "size": [2, 2]}, "inbound_nodes": [[["leakyrelu_41", 0, 0]]], "name": "upsampling2d_44"}, {"class_name": "Merge", "config": {"name": "merge_27", "concat_axis": 1, "mode_type": "raw", "dot_axes": [-1, -1], "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["upsampling2d_44", 0, 0], ["pool1", 0, 0]]], "name": "merge_27"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_131", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 8, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["merge_27", 0, 0]]], "name": "convolution2d_131"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_9"}, "inbound_nodes": [[["pool5", 0, 0]]], "name": "flatten_9"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_17", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 64}, "inbound_nodes": [[["flatten_9", 0, 0]]], "name": "dense_17"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": true, "name": "leakyrelu_42"}, "inbound_nodes": [[["convolution2d_131", 0, 0]]], "name": "leakyrelu_42"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": true, "name": "leakyrelu_38"}, "inbound_nodes": [[["dense_17", 0, 0]]], "name": "leakyrelu_38"}, {"class_name": "UpSampling2D", "config": {"trainable": true, "name": "upsampling2d_45", "size": [2, 2]}, "inbound_nodes": [[["leakyrelu_42", 0, 0]]], "name": "upsampling2d_45"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_18", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 32}, "inbound_nodes": [[["leakyrelu_38", 0, 0]]], "name": "dense_18"}, {"class_name": "Dropout", "config": {"p": 0.25, "trainable": true, "name": "dropout_54"}, "inbound_nodes": [[["upsampling2d_45", 0, 0]]], "name": "dropout_54"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_132", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 8, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["dropout_54", 0, 0]]], "name": "convolution2d_132"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": true, "name": "leakyrelu_39"}, "inbound_nodes": [[["dense_18", 0, 0]]], "name": "leakyrelu_39"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "outbin", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "sigmoid", "output_dim": 1}, "inbound_nodes": [[["leakyrelu_39", 0, 0]]], "name": "outbin"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "outmap", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 1, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "sigmoid", "nb_row": 3}, "inbound_nodes": [[["convolution2d_132", 0, 0]]], "name": "outmap"}], "input_layers": [["input_img", 0, 0]], "output_layers": [["outmap", 0, 0], ["outmap4", 0, 0], ["outmap5", 0, 0], ["outbin", 0, 0]], "name": "model_9"}}