{"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1, 128, 128], "name": "input_img", "input_dtype": "float32"}, "inbound_nodes": [], "name": "input_img"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_94", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 32, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["input_img", 0, 0]]], "name": "convolution2d_94"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_95", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 32, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["convolution2d_94", 0, 0]]], "name": "convolution2d_95"}, {"class_name": "Maxout2D", "config": {"output_dim": 16, "cardinality": 2, "trainable": true, "name": "maxout2d_42"}, "inbound_nodes": [[["convolution2d_95", 0, 0]]], "name": "maxout2d_42"}, {"class_name": "MaxPooling2D", "config": {"name": "pool1", "trainable": true, "dim_ordering": "th", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}, "inbound_nodes": [[["maxout2d_42", 0, 0]]], "name": "pool1"}, {"class_name": "Dropout", "config": {"p": 0.25, "trainable": true, "name": "dropout_37"}, "inbound_nodes": [[["pool1", 0, 0]]], "name": "dropout_37"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_96", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 32, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["dropout_37", 0, 0]]], "name": "convolution2d_96"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_97", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 32, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["convolution2d_96", 0, 0]]], "name": "convolution2d_97"}, {"class_name": "Maxout2D", "config": {"output_dim": 16, "cardinality": 2, "trainable": true, "name": "maxout2d_43"}, "inbound_nodes": [[["convolution2d_97", 0, 0]]], "name": "maxout2d_43"}, {"class_name": "MaxPooling2D", "config": {"name": "pool2", "trainable": true, "dim_ordering": "th", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}, "inbound_nodes": [[["maxout2d_43", 0, 0]]], "name": "pool2"}, {"class_name": "Dropout", "config": {"p": 0.25, "trainable": true, "name": "dropout_38"}, "inbound_nodes": [[["pool2", 0, 0]]], "name": "dropout_38"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_98", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 32, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["dropout_38", 0, 0]]], "name": "convolution2d_98"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_99", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 32, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["convolution2d_98", 0, 0]]], "name": "convolution2d_99"}, {"class_name": "Maxout2D", "config": {"output_dim": 16, "cardinality": 2, "trainable": true, "name": "maxout2d_44"}, "inbound_nodes": [[["convolution2d_99", 0, 0]]], "name": "maxout2d_44"}, {"class_name": "MaxPooling2D", "config": {"name": "pool3", "trainable": true, "dim_ordering": "th", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}, "inbound_nodes": [[["maxout2d_44", 0, 0]]], "name": "pool3"}, {"class_name": "Dropout", "config": {"p": 0.25, "trainable": true, "name": "dropout_39"}, "inbound_nodes": [[["pool3", 0, 0]]], "name": "dropout_39"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_100", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 32, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["dropout_39", 0, 0]]], "name": "convolution2d_100"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_101", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 32, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["convolution2d_100", 0, 0]]], "name": "convolution2d_101"}, {"class_name": "Maxout2D", "config": {"output_dim": 16, "cardinality": 2, "trainable": true, "name": "maxout2d_45"}, "inbound_nodes": [[["convolution2d_101", 0, 0]]], "name": "maxout2d_45"}, {"class_name": "MaxPooling2D", "config": {"name": "pool4", "trainable": true, "dim_ordering": "th", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}, "inbound_nodes": [[["maxout2d_45", 0, 0]]], "name": "pool4"}, {"class_name": "Dropout", "config": {"p": 0.25, "trainable": true, "name": "dropout_40"}, "inbound_nodes": [[["pool4", 0, 0]]], "name": "dropout_40"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_102", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 32, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["dropout_40", 0, 0]]], "name": "convolution2d_102"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_103", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 32, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["convolution2d_102", 0, 0]]], "name": "convolution2d_103"}, {"class_name": "Maxout2D", "config": {"output_dim": 16, "cardinality": 2, "trainable": true, "name": "maxout2d_46"}, "inbound_nodes": [[["convolution2d_103", 0, 0]]], "name": "maxout2d_46"}, {"class_name": "MaxPooling2D", "config": {"name": "pool5", "trainable": true, "dim_ordering": "th", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}, "inbound_nodes": [[["maxout2d_46", 0, 0]]], "name": "pool5"}, {"class_name": "Maxout2D", "config": {"output_dim": 8, "cardinality": 2, "trainable": true, "name": "maxout2d_47"}, "inbound_nodes": [[["pool5", 0, 0]]], "name": "maxout2d_47"}, {"class_name": "UpSampling2D", "config": {"trainable": true, "name": "upsampling2d_28", "size": [2, 2]}, "inbound_nodes": [[["maxout2d_47", 0, 0]]], "name": "upsampling2d_28"}, {"class_name": "Merge", "config": {"name": "merge_18", "concat_axis": 1, "mode_type": "raw", "dot_axes": [-1, -1], "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["upsampling2d_28", 0, 0], ["pool4", 0, 0]]], "name": "merge_18"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_104", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 16, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["merge_18", 0, 0]]], "name": "convolution2d_104"}, {"class_name": "Maxout2D", "config": {"output_dim": 8, "cardinality": 2, "trainable": true, "name": "maxout2d_48"}, "inbound_nodes": [[["convolution2d_104", 0, 0]]], "name": "maxout2d_48"}, {"class_name": "UpSampling2D", "config": {"trainable": true, "name": "upsampling2d_29", "size": [2, 2]}, "inbound_nodes": [[["maxout2d_48", 0, 0]]], "name": "upsampling2d_29"}, {"class_name": "Merge", "config": {"name": "merge_19", "concat_axis": 1, "mode_type": "raw", "dot_axes": [-1, -1], "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["upsampling2d_29", 0, 0], ["pool3", 0, 0]]], "name": "merge_19"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_105", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 16, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["merge_19", 0, 0]]], "name": "convolution2d_105"}, {"class_name": "Maxout2D", "config": {"output_dim": 8, "cardinality": 2, "trainable": true, "name": "maxout2d_49"}, "inbound_nodes": [[["convolution2d_105", 0, 0]]], "name": "maxout2d_49"}, {"class_name": "UpSampling2D", "config": {"trainable": true, "name": "upsampling2d_30", "size": [2, 2]}, "inbound_nodes": [[["maxout2d_49", 0, 0]]], "name": "upsampling2d_30"}, {"class_name": "Merge", "config": {"name": "merge_20", "concat_axis": 1, "mode_type": "raw", "dot_axes": [-1, -1], "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["upsampling2d_30", 0, 0], ["pool2", 0, 0]]], "name": "merge_20"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_106", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 16, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["merge_20", 0, 0]]], "name": "convolution2d_106"}, {"class_name": "Maxout2D", "config": {"output_dim": 8, "cardinality": 2, "trainable": true, "name": "maxout2d_50"}, "inbound_nodes": [[["convolution2d_106", 0, 0]]], "name": "maxout2d_50"}, {"class_name": "UpSampling2D", "config": {"trainable": true, "name": "upsampling2d_31", "size": [2, 2]}, "inbound_nodes": [[["maxout2d_50", 0, 0]]], "name": "upsampling2d_31"}, {"class_name": "Merge", "config": {"name": "merge_21", "concat_axis": 1, "mode_type": "raw", "dot_axes": [-1, -1], "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["upsampling2d_31", 0, 0], ["pool1", 0, 0]]], "name": "merge_21"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_107", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 16, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["merge_21", 0, 0]]], "name": "convolution2d_107"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_7"}, "inbound_nodes": [[["pool5", 0, 0]]], "name": "flatten_7"}, {"class_name": "Maxout2D", "config": {"output_dim": 8, "cardinality": 2, "trainable": true, "name": "maxout2d_51"}, "inbound_nodes": [[["convolution2d_107", 0, 0]]], "name": "maxout2d_51"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_13", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 32}, "inbound_nodes": [[["flatten_7", 0, 0]]], "name": "dense_13"}, {"class_name": "UpSampling2D", "config": {"trainable": true, "name": "upsampling2d_32", "size": [2, 2]}, "inbound_nodes": [[["maxout2d_51", 0, 0]]], "name": "upsampling2d_32"}, {"class_name": "Dropout", "config": {"p": 0.25, "trainable": true, "name": "dropout_41"}, "inbound_nodes": [[["upsampling2d_32", 0, 0]]], "name": "dropout_41"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": true, "name": "leakyrelu_13"}, "inbound_nodes": [[["dense_13", 0, 0]]], "name": "leakyrelu_13"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_108", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 8, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["dropout_41", 0, 0]]], "name": "convolution2d_108"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_14", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 16}, "inbound_nodes": [[["leakyrelu_13", 0, 0]]], "name": "dense_14"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_109", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 8, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["convolution2d_108", 0, 0]]], "name": "convolution2d_109"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": true, "name": "leakyrelu_14"}, "inbound_nodes": [[["dense_14", 0, 0]]], "name": "leakyrelu_14"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "outbin", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "sigmoid", "output_dim": 1}, "inbound_nodes": [[["leakyrelu_14", 0, 0]]], "name": "outbin"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "outmap", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 1, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "sigmoid", "nb_row": 3}, "inbound_nodes": [[["convolution2d_109", 0, 0]]], "name": "outmap"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "outmap4", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 1, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "sigmoid", "nb_row": 1}, "inbound_nodes": [[["maxout2d_48", 0, 0]]], "name": "outmap4"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "outmap5", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 1, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "sigmoid", "nb_row": 1}, "inbound_nodes": [[["maxout2d_47", 0, 0]]], "name": "outmap5"}], "input_layers": [["input_img", 0, 0]], "output_layers": [["outmap", 0, 0], ["outmap4", 0, 0], ["outmap5", 0, 0], ["outbin", 0, 0]], "name": "model_6"}}