{"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1, 128, 128], "name": "input_30", "input_dtype": "float32"}, "inbound_nodes": [], "name": "input_30"}, {"class_name": "ZeroPadding2D", "config": {"padding": [1, 1], "trainable": true, "name": "zeropadding2d_332"}, "inbound_nodes": [[["input_30", 0, 0]]], "name": "zeropadding2d_332"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_338", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 32, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["zeropadding2d_332", 0, 0]]], "name": "convolution2d_338"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": true, "name": "leakyrelu_342"}, "inbound_nodes": [[["convolution2d_338", 0, 0]]], "name": "leakyrelu_342"}, {"class_name": "ZeroPadding2D", "config": {"padding": [1, 1], "trainable": true, "name": "zeropadding2d_333"}, "inbound_nodes": [[["leakyrelu_342", 0, 0]]], "name": "zeropadding2d_333"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_339", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 32, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["zeropadding2d_333", 0, 0]]], "name": "convolution2d_339"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": true, "name": "leakyrelu_343"}, "inbound_nodes": [[["convolution2d_339", 0, 0]]], "name": "leakyrelu_343"}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_128", "trainable": true, "dim_ordering": "th", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}, "inbound_nodes": [[["leakyrelu_343", 0, 0]]], "name": "maxpooling2d_128"}, {"class_name": "Dropout", "config": {"p": 0.25, "trainable": true, "name": "pool1"}, "inbound_nodes": [[["maxpooling2d_128", 0, 0]]], "name": "pool1"}, {"class_name": "ZeroPadding2D", "config": {"padding": [1, 1], "trainable": true, "name": "zeropadding2d_334"}, "inbound_nodes": [[["pool1", 0, 0]]], "name": "zeropadding2d_334"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_340", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 32, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["zeropadding2d_334", 0, 0]]], "name": "convolution2d_340"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": true, "name": "leakyrelu_344"}, "inbound_nodes": [[["convolution2d_340", 0, 0]]], "name": "leakyrelu_344"}, {"class_name": "ZeroPadding2D", "config": {"padding": [1, 1], "trainable": true, "name": "zeropadding2d_335"}, "inbound_nodes": [[["leakyrelu_344", 0, 0]]], "name": "zeropadding2d_335"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_341", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 32, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["zeropadding2d_335", 0, 0]]], "name": "convolution2d_341"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": true, "name": "leakyrelu_345"}, "inbound_nodes": [[["convolution2d_341", 0, 0]]], "name": "leakyrelu_345"}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_129", "trainable": true, "dim_ordering": "th", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}, "inbound_nodes": [[["leakyrelu_345", 0, 0]]], "name": "maxpooling2d_129"}, {"class_name": "Dropout", "config": {"p": 0.25, "trainable": true, "name": "pool2"}, "inbound_nodes": [[["maxpooling2d_129", 0, 0]]], "name": "pool2"}, {"class_name": "ZeroPadding2D", "config": {"padding": [1, 1], "trainable": true, "name": "zeropadding2d_336"}, "inbound_nodes": [[["pool2", 0, 0]]], "name": "zeropadding2d_336"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_342", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 32, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["zeropadding2d_336", 0, 0]]], "name": "convolution2d_342"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": true, "name": "leakyrelu_346"}, "inbound_nodes": [[["convolution2d_342", 0, 0]]], "name": "leakyrelu_346"}, {"class_name": "ZeroPadding2D", "config": {"padding": [1, 1], "trainable": true, "name": "zeropadding2d_337"}, "inbound_nodes": [[["leakyrelu_346", 0, 0]]], "name": "zeropadding2d_337"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_343", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 32, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["zeropadding2d_337", 0, 0]]], "name": "convolution2d_343"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": true, "name": "leakyrelu_347"}, "inbound_nodes": [[["convolution2d_343", 0, 0]]], "name": "leakyrelu_347"}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_130", "trainable": true, "dim_ordering": "th", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}, "inbound_nodes": [[["leakyrelu_347", 0, 0]]], "name": "maxpooling2d_130"}, {"class_name": "Dropout", "config": {"p": 0.25, "trainable": true, "name": "pool3"}, "inbound_nodes": [[["maxpooling2d_130", 0, 0]]], "name": "pool3"}, {"class_name": "ZeroPadding2D", "config": {"padding": [1, 1], "trainable": true, "name": "zeropadding2d_338"}, "inbound_nodes": [[["pool3", 0, 0]]], "name": "zeropadding2d_338"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_344", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 32, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["zeropadding2d_338", 0, 0]]], "name": "convolution2d_344"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": true, "name": "leakyrelu_348"}, "inbound_nodes": [[["convolution2d_344", 0, 0]]], "name": "leakyrelu_348"}, {"class_name": "ZeroPadding2D", "config": {"padding": [1, 1], "trainable": true, "name": "zeropadding2d_339"}, "inbound_nodes": [[["leakyrelu_348", 0, 0]]], "name": "zeropadding2d_339"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_345", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 32, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["zeropadding2d_339", 0, 0]]], "name": "convolution2d_345"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": true, "name": "leakyrelu_349"}, "inbound_nodes": [[["convolution2d_345", 0, 0]]], "name": "leakyrelu_349"}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_131", "trainable": true, "dim_ordering": "th", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}, "inbound_nodes": [[["leakyrelu_349", 0, 0]]], "name": "maxpooling2d_131"}, {"class_name": "Dropout", "config": {"p": 0.1, "trainable": true, "name": "pool4"}, "inbound_nodes": [[["maxpooling2d_131", 0, 0]]], "name": "pool4"}, {"class_name": "ZeroPadding2D", "config": {"padding": [1, 1], "trainable": true, "name": "zeropadding2d_340"}, "inbound_nodes": [[["pool4", 0, 0]]], "name": "zeropadding2d_340"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_346", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 32, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["zeropadding2d_340", 0, 0]]], "name": "convolution2d_346"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": true, "name": "leakyrelu_350"}, "inbound_nodes": [[["convolution2d_346", 0, 0]]], "name": "leakyrelu_350"}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_132", "trainable": true, "dim_ordering": "th", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}, "inbound_nodes": [[["leakyrelu_350", 0, 0]]], "name": "maxpooling2d_132"}, {"class_name": "Dropout", "config": {"p": 0.1, "trainable": true, "name": "pool5"}, "inbound_nodes": [[["maxpooling2d_132", 0, 0]]], "name": "pool5"}, {"class_name": "ZeroPadding2D", "config": {"padding": [1, 1], "trainable": true, "name": "zeropadding2d_341"}, "inbound_nodes": [[["pool5", 0, 0]]], "name": "zeropadding2d_341"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_347", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 1, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["zeropadding2d_341", 0, 0]]], "name": "convolution2d_347"}, {"class_name": "ZeroPadding2D", "config": {"padding": [1, 1], "trainable": true, "name": "zeropadding2d_342"}, "inbound_nodes": [[["pool4", 0, 0]]], "name": "zeropadding2d_342"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_348", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 1, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["zeropadding2d_342", 0, 0]]], "name": "convolution2d_348"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": true, "name": "seg5"}, "inbound_nodes": [[["convolution2d_347", 0, 0]]], "name": "seg5"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": true, "name": "seg4"}, "inbound_nodes": [[["convolution2d_348", 0, 0]]], "name": "seg4"}, {"class_name": "UpSampling2D", "config": {"trainable": true, "name": "upsampling2d_50", "size": [2, 2]}, "inbound_nodes": [[["seg5", 0, 0]]], "name": "upsampling2d_50"}, {"class_name": "Merge", "config": {"name": "merge_32", "concat_axis": 1, "mode_type": "raw", "dot_axes": [-1, -1], "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["upsampling2d_50", 0, 0], ["seg4", 0, 0]]], "name": "merge_32"}, {"class_name": "ZeroPadding2D", "config": {"padding": [1, 1], "trainable": true, "name": "zeropadding2d_343"}, "inbound_nodes": [[["merge_32", 0, 0]]], "name": "zeropadding2d_343"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_349", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 1, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["zeropadding2d_343", 0, 0]]], "name": "convolution2d_349"}, {"class_name": "ZeroPadding2D", "config": {"padding": [1, 1], "trainable": true, "name": "zeropadding2d_344"}, "inbound_nodes": [[["pool3", 0, 0]]], "name": "zeropadding2d_344"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_350", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 1, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["zeropadding2d_344", 0, 0]]], "name": "convolution2d_350"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": true, "name": "leakyrelu_353"}, "inbound_nodes": [[["convolution2d_349", 0, 0]]], "name": "leakyrelu_353"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": true, "name": "seg3"}, "inbound_nodes": [[["convolution2d_350", 0, 0]]], "name": "seg3"}, {"class_name": "UpSampling2D", "config": {"trainable": true, "name": "upsampling2d_51", "size": [2, 2]}, "inbound_nodes": [[["leakyrelu_353", 0, 0]]], "name": "upsampling2d_51"}, {"class_name": "Merge", "config": {"name": "merge_33", "concat_axis": 1, "mode_type": "raw", "dot_axes": [-1, -1], "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["upsampling2d_51", 0, 0], ["seg3", 0, 0]]], "name": "merge_33"}, {"class_name": "ZeroPadding2D", "config": {"padding": [1, 1], "trainable": true, "name": "zeropadding2d_345"}, "inbound_nodes": [[["merge_33", 0, 0]]], "name": "zeropadding2d_345"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_351", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 1, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["zeropadding2d_345", 0, 0]]], "name": "convolution2d_351"}, {"class_name": "ZeroPadding2D", "config": {"padding": [1, 1], "trainable": true, "name": "zeropadding2d_346"}, "inbound_nodes": [[["pool2", 0, 0]]], "name": "zeropadding2d_346"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_352", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 1, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["zeropadding2d_346", 0, 0]]], "name": "convolution2d_352"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": true, "name": "leakyrelu_354"}, "inbound_nodes": [[["convolution2d_351", 0, 0]]], "name": "leakyrelu_354"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": true, "name": "seg2"}, "inbound_nodes": [[["convolution2d_352", 0, 0]]], "name": "seg2"}, {"class_name": "UpSampling2D", "config": {"trainable": true, "name": "upsampling2d_52", "size": [2, 2]}, "inbound_nodes": [[["leakyrelu_354", 0, 0]]], "name": "upsampling2d_52"}, {"class_name": "Merge", "config": {"name": "merge_34", "concat_axis": 1, "mode_type": "raw", "dot_axes": [-1, -1], "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["upsampling2d_52", 0, 0], ["seg2", 0, 0]]], "name": "merge_34"}, {"class_name": "ZeroPadding2D", "config": {"padding": [1, 1], "trainable": true, "name": "zeropadding2d_347"}, "inbound_nodes": [[["merge_34", 0, 0]]], "name": "zeropadding2d_347"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_353", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 1, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["zeropadding2d_347", 0, 0]]], "name": "convolution2d_353"}, {"class_name": "ZeroPadding2D", "config": {"padding": [1, 1], "trainable": true, "name": "zeropadding2d_348"}, "inbound_nodes": [[["pool1", 0, 0]]], "name": "zeropadding2d_348"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_354", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 1, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["zeropadding2d_348", 0, 0]]], "name": "convolution2d_354"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": true, "name": "leakyrelu_355"}, "inbound_nodes": [[["convolution2d_353", 0, 0]]], "name": "leakyrelu_355"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": true, "name": "seg1"}, "inbound_nodes": [[["convolution2d_354", 0, 0]]], "name": "seg1"}, {"class_name": "UpSampling2D", "config": {"trainable": true, "name": "upsampling2d_53", "size": [2, 2]}, "inbound_nodes": [[["leakyrelu_355", 0, 0]]], "name": "upsampling2d_53"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_30"}, "inbound_nodes": [[["pool5", 0, 0]]], "name": "flatten_30"}, {"class_name": "Merge", "config": {"name": "merge_35", "concat_axis": 1, "mode_type": "raw", "dot_axes": [-1, -1], "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["upsampling2d_53", 0, 0], ["seg1", 0, 0]]], "name": "merge_35"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_59", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 32}, "inbound_nodes": [[["flatten_30", 0, 0]]], "name": "dense_59"}, {"class_name": "ZeroPadding2D", "config": {"padding": [1, 1], "trainable": true, "name": "zeropadding2d_349"}, "inbound_nodes": [[["merge_35", 0, 0]]], "name": "zeropadding2d_349"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_355", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 1, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["zeropadding2d_349", 0, 0]]], "name": "convolution2d_355"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": true, "name": "leakyrelu_351"}, "inbound_nodes": [[["dense_59", 0, 0]]], "name": "leakyrelu_351"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_60", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 16}, "inbound_nodes": [[["leakyrelu_351", 0, 0]]], "name": "dense_60"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": true, "name": "leakyrelu_356"}, "inbound_nodes": [[["convolution2d_355", 0, 0]]], "name": "leakyrelu_356"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": true, "name": "leakyrelu_352"}, "inbound_nodes": [[["dense_60", 0, 0]]], "name": "leakyrelu_352"}, {"class_name": "UpSampling2D", "config": {"trainable": true, "name": "upsampling2d_54", "size": [2, 2]}, "inbound_nodes": [[["leakyrelu_356", 0, 0]]], "name": "upsampling2d_54"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "outbin", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "sigmoid", "output_dim": 1}, "inbound_nodes": [[["leakyrelu_352", 0, 0]]], "name": "outbin"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "outmap", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 1, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "sigmoid", "nb_row": 3}, "inbound_nodes": [[["upsampling2d_54", 0, 0]]], "name": "outmap"}], "input_layers": [["input_30", 0, 0]], "output_layers": [["outmap", 0, 0], ["outbin", 0, 0]], "name": "model_16"}}