{"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1, 128, 128], "name": "input_img", "input_dtype": "float32"}, "inbound_nodes": [], "name": "input_img"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_50", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 16, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["input_img", 0, 0]]], "name": "convolution2d_50"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_51", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 16, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["convolution2d_50", 0, 0]]], "name": "convolution2d_51"}, {"class_name": "Dropout", "config": {"p": 0.25, "trainable": true, "name": "dropout_16"}, "inbound_nodes": [[["convolution2d_51", 0, 0]]], "name": "dropout_16"}, {"class_name": "Maxout2D", "config": {"output_dim": 16, "cardinality": 2, "trainable": true, "name": "maxout2d_26"}, "inbound_nodes": [[["dropout_16", 0, 0]]], "name": "maxout2d_26"}, {"class_name": "MaxPooling2D", "config": {"name": "pool1", "trainable": true, "dim_ordering": "th", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}, "inbound_nodes": [[["maxout2d_26", 0, 0]]], "name": "pool1"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_52", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 16, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["pool1", 0, 0]]], "name": "convolution2d_52"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_53", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 16, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["convolution2d_52", 0, 0]]], "name": "convolution2d_53"}, {"class_name": "Dropout", "config": {"p": 0.25, "trainable": true, "name": "dropout_17"}, "inbound_nodes": [[["convolution2d_53", 0, 0]]], "name": "dropout_17"}, {"class_name": "Maxout2D", "config": {"output_dim": 16, "cardinality": 2, "trainable": true, "name": "maxout2d_27"}, "inbound_nodes": [[["dropout_17", 0, 0]]], "name": "maxout2d_27"}, {"class_name": "MaxPooling2D", "config": {"name": "pool2", "trainable": true, "dim_ordering": "th", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}, "inbound_nodes": [[["maxout2d_27", 0, 0]]], "name": "pool2"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_54", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 32, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["pool2", 0, 0]]], "name": "convolution2d_54"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_55", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 32, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["convolution2d_54", 0, 0]]], "name": "convolution2d_55"}, {"class_name": "Dropout", "config": {"p": 0.25, "trainable": true, "name": "dropout_18"}, "inbound_nodes": [[["convolution2d_55", 0, 0]]], "name": "dropout_18"}, {"class_name": "Maxout2D", "config": {"output_dim": 16, "cardinality": 2, "trainable": true, "name": "maxout2d_28"}, "inbound_nodes": [[["dropout_18", 0, 0]]], "name": "maxout2d_28"}, {"class_name": "MaxPooling2D", "config": {"name": "pool3", "trainable": true, "dim_ordering": "th", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}, "inbound_nodes": [[["maxout2d_28", 0, 0]]], "name": "pool3"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_56", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 16, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["pool3", 0, 0]]], "name": "convolution2d_56"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_57", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 16, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["convolution2d_56", 0, 0]]], "name": "convolution2d_57"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_60", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 16, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["pool3", 0, 0]]], "name": "convolution2d_60"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_61", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 16, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["convolution2d_60", 0, 0]]], "name": "convolution2d_61"}, {"class_name": "Dropout", "config": {"p": 0.25, "trainable": true, "name": "dropout_19"}, "inbound_nodes": [[["convolution2d_57", 0, 0]]], "name": "dropout_19"}, {"class_name": "Maxout2D", "config": {"output_dim": 16, "cardinality": 2, "trainable": true, "name": "maxout2d_29"}, "inbound_nodes": [[["dropout_19", 0, 0]]], "name": "maxout2d_29"}, {"class_name": "Maxout2D", "config": {"output_dim": 16, "cardinality": 2, "trainable": true, "name": "maxout2d_31"}, "inbound_nodes": [[["convolution2d_61", 0, 0]]], "name": "maxout2d_31"}, {"class_name": "MaxPooling2D", "config": {"name": "pool4", "trainable": true, "dim_ordering": "th", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}, "inbound_nodes": [[["maxout2d_29", 0, 0]]], "name": "pool4"}, {"class_name": "UpSampling2D", "config": {"trainable": true, "name": "upsampling2d_10", "size": [2, 2]}, "inbound_nodes": [[["maxout2d_31", 0, 0]]], "name": "upsampling2d_10"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_58", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 16, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["pool4", 0, 0]]], "name": "convolution2d_58"}, {"class_name": "Merge", "config": {"name": "merge_7", "concat_axis": 1, "mode_type": "raw", "dot_axes": [-1, -1], "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["upsampling2d_10", 0, 0], ["pool2", 0, 0]]], "name": "merge_7"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_59", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 16, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["convolution2d_58", 0, 0]]], "name": "convolution2d_59"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_62", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 16, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["merge_7", 0, 0]]], "name": "convolution2d_62"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_63", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 16, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["convolution2d_62", 0, 0]]], "name": "convolution2d_63"}, {"class_name": "Dropout", "config": {"p": 0.25, "trainable": true, "name": "dropout_20"}, "inbound_nodes": [[["convolution2d_59", 0, 0]]], "name": "dropout_20"}, {"class_name": "Maxout2D", "config": {"output_dim": 16, "cardinality": 2, "trainable": true, "name": "maxout2d_30"}, "inbound_nodes": [[["dropout_20", 0, 0]]], "name": "maxout2d_30"}, {"class_name": "Maxout2D", "config": {"output_dim": 16, "cardinality": 2, "trainable": true, "name": "maxout2d_32"}, "inbound_nodes": [[["convolution2d_63", 0, 0]]], "name": "maxout2d_32"}, {"class_name": "MaxPooling2D", "config": {"name": "pool5", "trainable": true, "dim_ordering": "th", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}, "inbound_nodes": [[["maxout2d_30", 0, 0]]], "name": "pool5"}, {"class_name": "UpSampling2D", "config": {"trainable": true, "name": "upsampling2d_11", "size": [2, 2]}, "inbound_nodes": [[["maxout2d_32", 0, 0]]], "name": "upsampling2d_11"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_4"}, "inbound_nodes": [[["pool5", 0, 0]]], "name": "flatten_4"}, {"class_name": "Merge", "config": {"name": "merge_8", "concat_axis": 1, "mode_type": "raw", "dot_axes": [-1, -1], "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["upsampling2d_11", 0, 0], ["pool1", 0, 0]]], "name": "merge_8"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_64", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 16, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["merge_8", 0, 0]]], "name": "convolution2d_64"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_7", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 32}, "inbound_nodes": [[["flatten_4", 0, 0]]], "name": "dense_7"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_65", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 16, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["convolution2d_64", 0, 0]]], "name": "convolution2d_65"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": true, "name": "leakyrelu_7"}, "inbound_nodes": [[["dense_7", 0, 0]]], "name": "leakyrelu_7"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_8", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 16}, "inbound_nodes": [[["leakyrelu_7", 0, 0]]], "name": "dense_8"}, {"class_name": "Maxout2D", "config": {"output_dim": 16, "cardinality": 2, "trainable": true, "name": "maxout2d_33"}, "inbound_nodes": [[["convolution2d_65", 0, 0]]], "name": "maxout2d_33"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": true, "name": "leakyrelu_8"}, "inbound_nodes": [[["dense_8", 0, 0]]], "name": "leakyrelu_8"}, {"class_name": "UpSampling2D", "config": {"trainable": true, "name": "upsampling2d_12", "size": [2, 2]}, "inbound_nodes": [[["maxout2d_33", 0, 0]]], "name": "upsampling2d_12"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "outbin", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "sigmoid", "output_dim": 1}, "inbound_nodes": [[["leakyrelu_8", 0, 0]]], "name": "outbin"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "outmap", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 1, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "sigmoid", "nb_row": 3}, "inbound_nodes": [[["upsampling2d_12", 0, 0]]], "name": "outmap"}], "input_layers": [["input_img", 0, 0]], "output_layers": [["outmap", 0, 0], ["outbin", 0, 0]], "name": "model_5"}}