{"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1, 104, 144], "name": "input_51", "input_dtype": "float32"}, "inbound_nodes": [], "name": "input_51"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_355", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 16, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["input_51", 0, 0]]], "name": "convolution2d_355"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": true, "name": "leakyrelu_37"}, "inbound_nodes": [[["convolution2d_355", 0, 0]]], "name": "leakyrelu_37"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_356", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 16, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["leakyrelu_37", 0, 0]]], "name": "convolution2d_356"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": true, "name": "leakyrelu_38"}, "inbound_nodes": [[["convolution2d_356", 0, 0]]], "name": "leakyrelu_38"}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_191", "trainable": true, "dim_ordering": "th", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "same"}, "inbound_nodes": [[["leakyrelu_38", 0, 0]]], "name": "maxpooling2d_191"}, {"class_name": "Dropout", "config": {"p": 0.25, "trainable": true, "name": "pool1"}, "inbound_nodes": [[["maxpooling2d_191", 0, 0]]], "name": "pool1"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_357", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 32, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["pool1", 0, 0]]], "name": "convolution2d_357"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": true, "name": "leakyrelu_39"}, "inbound_nodes": [[["convolution2d_357", 0, 0]]], "name": "leakyrelu_39"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_358", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 32, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["leakyrelu_39", 0, 0]]], "name": "convolution2d_358"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": true, "name": "leakyrelu_40"}, "inbound_nodes": [[["convolution2d_358", 0, 0]]], "name": "leakyrelu_40"}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_192", "trainable": true, "dim_ordering": "th", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "same"}, "inbound_nodes": [[["leakyrelu_40", 0, 0]]], "name": "maxpooling2d_192"}, {"class_name": "Dropout", "config": {"p": 0.25, "trainable": true, "name": "pool2"}, "inbound_nodes": [[["maxpooling2d_192", 0, 0]]], "name": "pool2"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_359", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 64, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["pool2", 0, 0]]], "name": "convolution2d_359"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": true, "name": "leakyrelu_41"}, "inbound_nodes": [[["convolution2d_359", 0, 0]]], "name": "leakyrelu_41"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_360", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 64, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["leakyrelu_41", 0, 0]]], "name": "convolution2d_360"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": true, "name": "leakyrelu_42"}, "inbound_nodes": [[["convolution2d_360", 0, 0]]], "name": "leakyrelu_42"}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_193", "trainable": true, "dim_ordering": "th", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "same"}, "inbound_nodes": [[["leakyrelu_42", 0, 0]]], "name": "maxpooling2d_193"}, {"class_name": "Dropout", "config": {"p": 0.25, "trainable": true, "name": "pool3"}, "inbound_nodes": [[["maxpooling2d_193", 0, 0]]], "name": "pool3"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_361", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 32, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["pool3", 0, 0]]], "name": "convolution2d_361"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": true, "name": "leakyrelu_43"}, "inbound_nodes": [[["convolution2d_361", 0, 0]]], "name": "leakyrelu_43"}, {"class_name": "UpSampling2D", "config": {"trainable": true, "name": "upsampling2d_138", "size": [2, 2]}, "inbound_nodes": [[["leakyrelu_43", 0, 0]]], "name": "upsampling2d_138"}, {"class_name": "Merge", "config": {"name": "merge_92", "concat_axis": -1, "mode_type": "raw", "dot_axes": [-1, -1], "mode": "sum", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["upsampling2d_138", 0, 0], ["pool2", 0, 0]]], "name": "merge_92"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_362", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 16, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["merge_92", 0, 0]]], "name": "convolution2d_362"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": true, "name": "leakyrelu_44"}, "inbound_nodes": [[["convolution2d_362", 0, 0]]], "name": "leakyrelu_44"}, {"class_name": "UpSampling2D", "config": {"trainable": true, "name": "upsampling2d_139", "size": [2, 2]}, "inbound_nodes": [[["leakyrelu_44", 0, 0]]], "name": "upsampling2d_139"}, {"class_name": "Merge", "config": {"name": "merge_93", "concat_axis": -1, "mode_type": "raw", "dot_axes": [-1, -1], "mode": "sum", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["upsampling2d_139", 0, 0], ["pool1", 0, 0]]], "name": "merge_93"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_363", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 16, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["merge_93", 0, 0]]], "name": "convolution2d_363"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": true, "name": "leakyrelu_45"}, "inbound_nodes": [[["convolution2d_363", 0, 0]]], "name": "leakyrelu_45"}, {"class_name": "UpSampling2D", "config": {"trainable": true, "name": "upsampling2d_140", "size": [2, 2]}, "inbound_nodes": [[["leakyrelu_45", 0, 0]]], "name": "upsampling2d_140"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "outmap", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 1, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "sigmoid", "nb_row": 3}, "inbound_nodes": [[["upsampling2d_140", 0, 0]]], "name": "outmap"}], "input_layers": [["input_51", 0, 0]], "output_layers": [["outmap", 0, 0]], "name": "model_30"}}