{"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1, 128, 128], "name": "input_img", "input_dtype": "float32"}, "inbound_nodes": [], "name": "input_img"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_1", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 32, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["input_img", 0, 0]]], "name": "convolution2d_1"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_2", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 32, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["convolution2d_1", 0, 0]]], "name": "convolution2d_2"}, {"class_name": "Maxout2D", "config": {"output_dim": 32, "cardinality": 2, "trainable": true, "name": "maxout2d_1"}, "inbound_nodes": [[["convolution2d_2", 0, 0]]], "name": "maxout2d_1"}, {"class_name": "MaxPooling2D", "config": {"name": "pool1", "trainable": true, "dim_ordering": "th", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}, "inbound_nodes": [[["maxout2d_1", 0, 0]]], "name": "pool1"}, {"class_name": "Dropout", "config": {"p": 0.25, "trainable": true, "name": "dropout_2"}, "inbound_nodes": [[["pool1", 0, 0]]], "name": "dropout_2"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_3", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 32, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["dropout_2", 0, 0]]], "name": "convolution2d_3"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_4", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 32, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["convolution2d_3", 0, 0]]], "name": "convolution2d_4"}, {"class_name": "Maxout2D", "config": {"output_dim": 32, "cardinality": 2, "trainable": true, "name": "maxout2d_2"}, "inbound_nodes": [[["convolution2d_4", 0, 0]]], "name": "maxout2d_2"}, {"class_name": "MaxPooling2D", "config": {"name": "pool2", "trainable": true, "dim_ordering": "th", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}, "inbound_nodes": [[["maxout2d_2", 0, 0]]], "name": "pool2"}, {"class_name": "Dropout", "config": {"p": 0.25, "trainable": true, "name": "dropout_3"}, "inbound_nodes": [[["pool2", 0, 0]]], "name": "dropout_3"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_5", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 32, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["dropout_3", 0, 0]]], "name": "convolution2d_5"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_6", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 32, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["convolution2d_5", 0, 0]]], "name": "convolution2d_6"}, {"class_name": "Maxout2D", "config": {"output_dim": 32, "cardinality": 2, "trainable": true, "name": "maxout2d_3"}, "inbound_nodes": [[["convolution2d_6", 0, 0]]], "name": "maxout2d_3"}, {"class_name": "MaxPooling2D", "config": {"name": "pool3", "trainable": true, "dim_ordering": "th", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}, "inbound_nodes": [[["maxout2d_3", 0, 0]]], "name": "pool3"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_9", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 8, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["pool3", 0, 0]]], "name": "convolution2d_9"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_10", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 8, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["convolution2d_9", 0, 0]]], "name": "convolution2d_10"}, {"class_name": "Maxout2D", "config": {"output_dim": 8, "cardinality": 4, "trainable": true, "name": "maxout2d_7"}, "inbound_nodes": [[["convolution2d_10", 0, 0]]], "name": "maxout2d_7"}, {"class_name": "Maxout2D", "config": {"output_dim": 16, "cardinality": 4, "trainable": true, "name": "maxout2d_8"}, "inbound_nodes": [[["pool2", 0, 0]]], "name": "maxout2d_8"}, {"class_name": "UpSampling2D", "config": {"trainable": true, "name": "upsampling2d_2", "size": [2, 2]}, "inbound_nodes": [[["maxout2d_7", 0, 0]]], "name": "upsampling2d_2"}, {"class_name": "Merge", "config": {"name": "merge_2", "concat_axis": 1, "mode_type": "raw", "dot_axes": [-1, -1], "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["upsampling2d_2", 0, 0], ["maxout2d_8", 0, 0]]], "name": "merge_2"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_11", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 16, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["merge_2", 0, 0]]], "name": "convolution2d_11"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_12", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 16, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["convolution2d_11", 0, 0]]], "name": "convolution2d_12"}, {"class_name": "Maxout2D", "config": {"output_dim": 16, "cardinality": 4, "trainable": true, "name": "maxout2d_9"}, "inbound_nodes": [[["convolution2d_12", 0, 0]]], "name": "maxout2d_9"}, {"class_name": "Maxout2D", "config": {"output_dim": 16, "cardinality": 4, "trainable": true, "name": "maxout2d_10"}, "inbound_nodes": [[["pool1", 0, 0]]], "name": "maxout2d_10"}, {"class_name": "UpSampling2D", "config": {"trainable": true, "name": "upsampling2d_3", "size": [2, 2]}, "inbound_nodes": [[["maxout2d_9", 0, 0]]], "name": "upsampling2d_3"}, {"class_name": "Merge", "config": {"name": "merge_3", "concat_axis": 1, "mode_type": "raw", "dot_axes": [-1, -1], "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["upsampling2d_3", 0, 0], ["maxout2d_10", 0, 0]]], "name": "merge_3"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_13", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 16, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["merge_3", 0, 0]]], "name": "convolution2d_13"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_14", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 16, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["convolution2d_13", 0, 0]]], "name": "convolution2d_14"}, {"class_name": "Dropout", "config": {"p": 0.25, "trainable": true, "name": "dropout_4"}, "inbound_nodes": [[["pool3", 0, 0]]], "name": "dropout_4"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_7", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 32, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["dropout_4", 0, 0]]], "name": "convolution2d_7"}, {"class_name": "Maxout2D", "config": {"output_dim": 16, "cardinality": 4, "trainable": true, "name": "maxout2d_11"}, "inbound_nodes": [[["convolution2d_14", 0, 0]]], "name": "maxout2d_11"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_8", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 32, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["convolution2d_7", 0, 0]]], "name": "convolution2d_8"}, {"class_name": "UpSampling2D", "config": {"trainable": true, "name": "upsampling2d_4", "size": [2, 2]}, "inbound_nodes": [[["maxout2d_11", 0, 0]]], "name": "upsampling2d_4"}, {"class_name": "Dropout", "config": {"p": 0.25, "trainable": true, "name": "dropout_5"}, "inbound_nodes": [[["upsampling2d_4", 0, 0]]], "name": "dropout_5"}, {"class_name": "Maxout2D", "config": {"output_dim": 32, "cardinality": 2, "trainable": true, "name": "maxout2d_4"}, "inbound_nodes": [[["convolution2d_8", 0, 0]]], "name": "maxout2d_4"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_15", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 16, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["dropout_5", 0, 0]]], "name": "convolution2d_15"}, {"class_name": "MaxPooling2D", "config": {"name": "pool4", "trainable": true, "dim_ordering": "th", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}, "inbound_nodes": [[["maxout2d_4", 0, 0]]], "name": "pool4"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_16", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 16, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["convolution2d_15", 0, 0]]], "name": "convolution2d_16"}, {"class_name": "Maxout2D", "config": {"output_dim": 8, "cardinality": 4, "trainable": true, "name": "maxout2d_5"}, "inbound_nodes": [[["pool4", 0, 0]]], "name": "maxout2d_5"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "outmap", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 1, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "sigmoid", "nb_row": 3}, "inbound_nodes": [[["convolution2d_16", 0, 0]]], "name": "outmap"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "outmap4", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 1, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "sigmoid", "nb_row": 1}, "inbound_nodes": [[["maxout2d_5", 0, 0]]], "name": "outmap4"}], "input_layers": [["input_img", 0, 0]], "output_layers": [["outmap", 0, 0], ["outmap4", 0, 0]], "name": "model_1"}}