{"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1, 128, 128], "name": "input_16", "input_dtype": "float32"}, "inbound_nodes": [], "name": "input_16"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_240", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 16, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["input_16", 0, 0]]], "name": "convolution2d_240"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": true, "name": "leakyrelu_237"}, "inbound_nodes": [[["convolution2d_240", 0, 0]]], "name": "leakyrelu_237"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_241", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 16, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["leakyrelu_237", 0, 0]]], "name": "convolution2d_241"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": true, "name": "leakyrelu_238"}, "inbound_nodes": [[["convolution2d_241", 0, 0]]], "name": "leakyrelu_238"}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_58", "trainable": true, "dim_ordering": "th", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}, "inbound_nodes": [[["leakyrelu_238", 0, 0]]], "name": "maxpooling2d_58"}, {"class_name": "Dropout", "config": {"p": 0.25, "trainable": true, "name": "pool1"}, "inbound_nodes": [[["maxpooling2d_58", 0, 0]]], "name": "pool1"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_242", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 32, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["pool1", 0, 0]]], "name": "convolution2d_242"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": true, "name": "leakyrelu_239"}, "inbound_nodes": [[["convolution2d_242", 0, 0]]], "name": "leakyrelu_239"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_243", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 32, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["leakyrelu_239", 0, 0]]], "name": "convolution2d_243"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": true, "name": "leakyrelu_240"}, "inbound_nodes": [[["convolution2d_243", 0, 0]]], "name": "leakyrelu_240"}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_59", "trainable": true, "dim_ordering": "th", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}, "inbound_nodes": [[["leakyrelu_240", 0, 0]]], "name": "maxpooling2d_59"}, {"class_name": "Dropout", "config": {"p": 0.1, "trainable": true, "name": "pool2"}, "inbound_nodes": [[["maxpooling2d_59", 0, 0]]], "name": "pool2"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_244", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 64, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["pool2", 0, 0]]], "name": "convolution2d_244"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": true, "name": "leakyrelu_241"}, "inbound_nodes": [[["convolution2d_244", 0, 0]]], "name": "leakyrelu_241"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_245", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 64, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["leakyrelu_241", 0, 0]]], "name": "convolution2d_245"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": true, "name": "leakyrelu_242"}, "inbound_nodes": [[["convolution2d_245", 0, 0]]], "name": "leakyrelu_242"}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_60", "trainable": true, "dim_ordering": "th", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}, "inbound_nodes": [[["leakyrelu_242", 0, 0]]], "name": "maxpooling2d_60"}, {"class_name": "Dropout", "config": {"p": 0.1, "trainable": true, "name": "pool3"}, "inbound_nodes": [[["maxpooling2d_60", 0, 0]]], "name": "pool3"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_246", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 64, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["pool3", 0, 0]]], "name": "convolution2d_246"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": true, "name": "leakyrelu_243"}, "inbound_nodes": [[["convolution2d_246", 0, 0]]], "name": "leakyrelu_243"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_247", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 64, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["leakyrelu_243", 0, 0]]], "name": "convolution2d_247"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": true, "name": "leakyrelu_244"}, "inbound_nodes": [[["convolution2d_247", 0, 0]]], "name": "leakyrelu_244"}, {"class_name": "MaxPooling2D", "config": {"name": "pool4", "trainable": true, "dim_ordering": "th", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}, "inbound_nodes": [[["leakyrelu_244", 0, 0]]], "name": "pool4"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_248", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 32, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["pool4", 0, 0]]], "name": "convolution2d_248"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": true, "name": "leakyrelu_245"}, "inbound_nodes": [[["convolution2d_248", 0, 0]]], "name": "leakyrelu_245"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_249", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 16, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["leakyrelu_245", 0, 0]]], "name": "convolution2d_249"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": true, "name": "leakyrelu_246"}, "inbound_nodes": [[["convolution2d_249", 0, 0]]], "name": "leakyrelu_246"}, {"class_name": "MaxPooling2D", "config": {"name": "pool5", "trainable": true, "dim_ordering": "th", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}, "inbound_nodes": [[["leakyrelu_246", 0, 0]]], "name": "pool5"}, {"class_name": "UpSampling2D", "config": {"trainable": true, "name": "upsampling2d_80", "size": [2, 2]}, "inbound_nodes": [[["pool5", 0, 0]]], "name": "upsampling2d_80"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_250", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 64, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["upsampling2d_80", 0, 0]]], "name": "convolution2d_250"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": true, "name": "leakyrelu_247"}, "inbound_nodes": [[["convolution2d_250", 0, 0]]], "name": "leakyrelu_247"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_251", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 64, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["leakyrelu_247", 0, 0]]], "name": "convolution2d_251"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": true, "name": "leakyrelu_248"}, "inbound_nodes": [[["convolution2d_251", 0, 0]]], "name": "leakyrelu_248"}, {"class_name": "UpSampling2D", "config": {"trainable": true, "name": "upsampling2d_81", "size": [2, 2]}, "inbound_nodes": [[["leakyrelu_248", 0, 0]]], "name": "upsampling2d_81"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_252", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 64, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["upsampling2d_81", 0, 0]]], "name": "convolution2d_252"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": true, "name": "leakyrelu_249"}, "inbound_nodes": [[["convolution2d_252", 0, 0]]], "name": "leakyrelu_249"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_253", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 64, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["leakyrelu_249", 0, 0]]], "name": "convolution2d_253"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": true, "name": "leakyrelu_250"}, "inbound_nodes": [[["convolution2d_253", 0, 0]]], "name": "leakyrelu_250"}, {"class_name": "UpSampling2D", "config": {"trainable": true, "name": "upsampling2d_82", "size": [2, 2]}, "inbound_nodes": [[["leakyrelu_250", 0, 0]]], "name": "upsampling2d_82"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_254", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 64, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["upsampling2d_82", 0, 0]]], "name": "convolution2d_254"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": true, "name": "leakyrelu_251"}, "inbound_nodes": [[["convolution2d_254", 0, 0]]], "name": "leakyrelu_251"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_255", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 64, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["leakyrelu_251", 0, 0]]], "name": "convolution2d_255"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": true, "name": "leakyrelu_252"}, "inbound_nodes": [[["convolution2d_255", 0, 0]]], "name": "leakyrelu_252"}, {"class_name": "UpSampling2D", "config": {"trainable": true, "name": "upsampling2d_83", "size": [2, 2]}, "inbound_nodes": [[["leakyrelu_252", 0, 0]]], "name": "upsampling2d_83"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_256", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 32, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["upsampling2d_83", 0, 0]]], "name": "convolution2d_256"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": true, "name": "leakyrelu_253"}, "inbound_nodes": [[["convolution2d_256", 0, 0]]], "name": "leakyrelu_253"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_257", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 32, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["leakyrelu_253", 0, 0]]], "name": "convolution2d_257"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": true, "name": "leakyrelu_254"}, "inbound_nodes": [[["convolution2d_257", 0, 0]]], "name": "leakyrelu_254"}, {"class_name": "UpSampling2D", "config": {"trainable": true, "name": "upsampling2d_84", "size": [2, 2]}, "inbound_nodes": [[["leakyrelu_254", 0, 0]]], "name": "upsampling2d_84"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_258", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 16, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["upsampling2d_84", 0, 0]]], "name": "convolution2d_258"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": true, "name": "leakyrelu_255"}, "inbound_nodes": [[["convolution2d_258", 0, 0]]], "name": "leakyrelu_255"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_259", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 16, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["leakyrelu_255", 0, 0]]], "name": "convolution2d_259"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": true, "name": "leakyrelu_256"}, "inbound_nodes": [[["convolution2d_259", 0, 0]]], "name": "leakyrelu_256"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_260", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 1, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["leakyrelu_256", 0, 0]]], "name": "convolution2d_260"}, {"class_name": "Activation", "config": {"activation": "sigmoid", "trainable": true, "name": "activation_2"}, "inbound_nodes": [[["convolution2d_260", 0, 0]]], "name": "activation_2"}], "input_layers": [["input_16", 0, 0]], "output_layers": [["activation_2", 0, 0]], "name": "model_14"}}