{"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1, 128, 128], "name": "input_16", "input_dtype": "float32"}, "inbound_nodes": [], "name": "input_16"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_240", "activity_regularizer": null, "trainable": false, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 16, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["input_16", 0, 0]]], "name": "convolution2d_240"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": false, "name": "leakyrelu_237"}, "inbound_nodes": [[["convolution2d_240", 0, 0]]], "name": "leakyrelu_237"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_241", "activity_regularizer": null, "trainable": false, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 16, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["leakyrelu_237", 0, 0]]], "name": "convolution2d_241"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": false, "name": "leakyrelu_238"}, "inbound_nodes": [[["convolution2d_241", 0, 0]]], "name": "leakyrelu_238"}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_58", "trainable": false, "dim_ordering": "th", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}, "inbound_nodes": [[["leakyrelu_238", 0, 0]]], "name": "maxpooling2d_58"}, {"class_name": "Dropout", "config": {"p": 0.25, "trainable": false, "name": "pool1"}, "inbound_nodes": [[["maxpooling2d_58", 0, 0]]], "name": "pool1"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_242", "activity_regularizer": null, "trainable": false, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 32, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["pool1", 0, 0]]], "name": "convolution2d_242"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": false, "name": "leakyrelu_239"}, "inbound_nodes": [[["convolution2d_242", 0, 0]]], "name": "leakyrelu_239"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_243", "activity_regularizer": null, "trainable": false, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 32, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["leakyrelu_239", 0, 0]]], "name": "convolution2d_243"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": false, "name": "leakyrelu_240"}, "inbound_nodes": [[["convolution2d_243", 0, 0]]], "name": "leakyrelu_240"}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_59", "trainable": false, "dim_ordering": "th", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}, "inbound_nodes": [[["leakyrelu_240", 0, 0]]], "name": "maxpooling2d_59"}, {"class_name": "Dropout", "config": {"p": 0.1, "trainable": false, "name": "pool2"}, "inbound_nodes": [[["maxpooling2d_59", 0, 0]]], "name": "pool2"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_244", "activity_regularizer": null, "trainable": false, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 64, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["pool2", 0, 0]]], "name": "convolution2d_244"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": false, "name": "leakyrelu_241"}, "inbound_nodes": [[["convolution2d_244", 0, 0]]], "name": "leakyrelu_241"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_245", "activity_regularizer": null, "trainable": false, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 64, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["leakyrelu_241", 0, 0]]], "name": "convolution2d_245"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": false, "name": "leakyrelu_242"}, "inbound_nodes": [[["convolution2d_245", 0, 0]]], "name": "leakyrelu_242"}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_60", "trainable": false, "dim_ordering": "th", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}, "inbound_nodes": [[["leakyrelu_242", 0, 0]]], "name": "maxpooling2d_60"}, {"class_name": "Dropout", "config": {"p": 0.1, "trainable": false, "name": "pool3"}, "inbound_nodes": [[["maxpooling2d_60", 0, 0]]], "name": "pool3"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_246", "activity_regularizer": null, "trainable": false, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 64, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["pool3", 0, 0]]], "name": "convolution2d_246"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": false, "name": "leakyrelu_243"}, "inbound_nodes": [[["convolution2d_246", 0, 0]]], "name": "leakyrelu_243"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_247", "activity_regularizer": null, "trainable": false, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 64, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["leakyrelu_243", 0, 0]]], "name": "convolution2d_247"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": false, "name": "leakyrelu_244"}, "inbound_nodes": [[["convolution2d_247", 0, 0]]], "name": "leakyrelu_244"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_25", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 16, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["pool3", 0, 0]]], "name": "convolution2d_25"}, {"class_name": "MaxPooling2D", "config": {"name": "pool4", "trainable": false, "dim_ordering": "th", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}, "inbound_nodes": [[["leakyrelu_244", 0, 0]]], "name": "pool4"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_248", "activity_regularizer": null, "trainable": false, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 32, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["pool4", 0, 0]]], "name": "convolution2d_248"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": true, "name": "leakyrelu_43"}, "inbound_nodes": [[["convolution2d_25", 0, 0]]], "name": "leakyrelu_43"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": false, "name": "leakyrelu_245"}, "inbound_nodes": [[["convolution2d_248", 0, 0]]], "name": "leakyrelu_245"}, {"class_name": "UpSampling2D", "config": {"trainable": true, "name": "upsampling2d_25", "size": [2, 2]}, "inbound_nodes": [[["leakyrelu_43", 0, 0]]], "name": "upsampling2d_25"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_249", "activity_regularizer": null, "trainable": false, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 16, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["leakyrelu_245", 0, 0]]], "name": "convolution2d_249"}, {"class_name": "Merge", "config": {"name": "merge_17", "concat_axis": 1, "mode_type": "raw", "dot_axes": [-1, -1], "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["upsampling2d_25", 0, 0], ["pool2", 0, 0]]], "name": "merge_17"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_26", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 16, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["merge_17", 0, 0]]], "name": "convolution2d_26"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": false, "name": "leakyrelu_246"}, "inbound_nodes": [[["convolution2d_249", 0, 0]]], "name": "leakyrelu_246"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": true, "name": "leakyrelu_44"}, "inbound_nodes": [[["convolution2d_26", 0, 0]]], "name": "leakyrelu_44"}, {"class_name": "MaxPooling2D", "config": {"name": "pool5", "trainable": false, "dim_ordering": "th", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}, "inbound_nodes": [[["leakyrelu_246", 0, 0]]], "name": "pool5"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_10"}, "inbound_nodes": [[["pool5", 0, 0]]], "name": "flatten_10"}, {"class_name": "UpSampling2D", "config": {"trainable": true, "name": "upsampling2d_26", "size": [2, 2]}, "inbound_nodes": [[["leakyrelu_44", 0, 0]]], "name": "upsampling2d_26"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_17", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 32}, "inbound_nodes": [[["flatten_10", 0, 0]]], "name": "dense_17"}, {"class_name": "Merge", "config": {"name": "merge_18", "concat_axis": 1, "mode_type": "raw", "dot_axes": [-1, -1], "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["upsampling2d_26", 0, 0], ["pool1", 0, 0]]], "name": "merge_18"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_27", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 5, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 16, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 5}, "inbound_nodes": [[["merge_18", 0, 0]]], "name": "convolution2d_27"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": true, "name": "leakyrelu_41"}, "inbound_nodes": [[["dense_17", 0, 0]]], "name": "leakyrelu_41"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_18", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 16}, "inbound_nodes": [[["leakyrelu_41", 0, 0]]], "name": "dense_18"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": true, "name": "leakyrelu_45"}, "inbound_nodes": [[["convolution2d_27", 0, 0]]], "name": "leakyrelu_45"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": true, "name": "leakyrelu_42"}, "inbound_nodes": [[["dense_18", 0, 0]]], "name": "leakyrelu_42"}, {"class_name": "UpSampling2D", "config": {"trainable": true, "name": "upsampling2d_27", "size": [2, 2]}, "inbound_nodes": [[["leakyrelu_45", 0, 0]]], "name": "upsampling2d_27"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "outbin", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "sigmoid", "output_dim": 1}, "inbound_nodes": [[["leakyrelu_42", 0, 0]]], "name": "outbin"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "outmap", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 1, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "sigmoid", "nb_row": 3}, "inbound_nodes": [[["upsampling2d_27", 0, 0]]], "name": "outmap"}], "input_layers": [["input_16", 0, 0]], "output_layers": [["outmap", 0, 0], ["outbin", 0, 0]], "name": "model_9"}}