{"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1, 128, 128], "name": "input_4", "input_dtype": "float32"}, "inbound_nodes": [], "name": "input_4"}, {"class_name": "ZeroPadding2D", "config": {"padding": [1, 1], "trainable": true, "name": "zeropadding2d_37"}, "inbound_nodes": [[["input_4", 0, 0]]], "name": "zeropadding2d_37"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_37", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 16, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["zeropadding2d_37", 0, 0]]], "name": "convolution2d_37"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": true, "name": "leakyrelu_43"}, "inbound_nodes": [[["convolution2d_37", 0, 0]]], "name": "leakyrelu_43"}, {"class_name": "ZeroPadding2D", "config": {"padding": [1, 1], "trainable": true, "name": "zeropadding2d_38"}, "inbound_nodes": [[["leakyrelu_43", 0, 0]]], "name": "zeropadding2d_38"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_38", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 16, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["zeropadding2d_38", 0, 0]]], "name": "convolution2d_38"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": true, "name": "leakyrelu_44"}, "inbound_nodes": [[["convolution2d_38", 0, 0]]], "name": "leakyrelu_44"}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_16", "trainable": true, "dim_ordering": "th", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}, "inbound_nodes": [[["leakyrelu_44", 0, 0]]], "name": "maxpooling2d_16"}, {"class_name": "Dropout", "config": {"p": 0.25, "trainable": true, "name": "pool1"}, "inbound_nodes": [[["maxpooling2d_16", 0, 0]]], "name": "pool1"}, {"class_name": "ZeroPadding2D", "config": {"padding": [1, 1], "trainable": true, "name": "zeropadding2d_39"}, "inbound_nodes": [[["pool1", 0, 0]]], "name": "zeropadding2d_39"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_39", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 16, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["zeropadding2d_39", 0, 0]]], "name": "convolution2d_39"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": true, "name": "leakyrelu_45"}, "inbound_nodes": [[["convolution2d_39", 0, 0]]], "name": "leakyrelu_45"}, {"class_name": "ZeroPadding2D", "config": {"padding": [1, 1], "trainable": true, "name": "zeropadding2d_40"}, "inbound_nodes": [[["leakyrelu_45", 0, 0]]], "name": "zeropadding2d_40"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_40", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 16, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["zeropadding2d_40", 0, 0]]], "name": "convolution2d_40"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": true, "name": "leakyrelu_46"}, "inbound_nodes": [[["convolution2d_40", 0, 0]]], "name": "leakyrelu_46"}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_17", "trainable": true, "dim_ordering": "th", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}, "inbound_nodes": [[["leakyrelu_46", 0, 0]]], "name": "maxpooling2d_17"}, {"class_name": "Dropout", "config": {"p": 0.25, "trainable": true, "name": "pool2"}, "inbound_nodes": [[["maxpooling2d_17", 0, 0]]], "name": "pool2"}, {"class_name": "ZeroPadding2D", "config": {"padding": [1, 1], "trainable": true, "name": "zeropadding2d_41"}, "inbound_nodes": [[["pool2", 0, 0]]], "name": "zeropadding2d_41"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_41", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 16, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["zeropadding2d_41", 0, 0]]], "name": "convolution2d_41"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": true, "name": "leakyrelu_47"}, "inbound_nodes": [[["convolution2d_41", 0, 0]]], "name": "leakyrelu_47"}, {"class_name": "ZeroPadding2D", "config": {"padding": [1, 1], "trainable": true, "name": "zeropadding2d_42"}, "inbound_nodes": [[["leakyrelu_47", 0, 0]]], "name": "zeropadding2d_42"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_42", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 16, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["zeropadding2d_42", 0, 0]]], "name": "convolution2d_42"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": true, "name": "leakyrelu_48"}, "inbound_nodes": [[["convolution2d_42", 0, 0]]], "name": "leakyrelu_48"}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_18", "trainable": true, "dim_ordering": "th", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}, "inbound_nodes": [[["leakyrelu_48", 0, 0]]], "name": "maxpooling2d_18"}, {"class_name": "Dropout", "config": {"p": 0.25, "trainable": true, "name": "pool3"}, "inbound_nodes": [[["maxpooling2d_18", 0, 0]]], "name": "pool3"}, {"class_name": "ZeroPadding2D", "config": {"padding": [1, 1], "trainable": true, "name": "zeropadding2d_43"}, "inbound_nodes": [[["pool3", 0, 0]]], "name": "zeropadding2d_43"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_43", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 16, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["zeropadding2d_43", 0, 0]]], "name": "convolution2d_43"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": true, "name": "leakyrelu_49"}, "inbound_nodes": [[["convolution2d_43", 0, 0]]], "name": "leakyrelu_49"}, {"class_name": "ZeroPadding2D", "config": {"padding": [1, 1], "trainable": true, "name": "zeropadding2d_44"}, "inbound_nodes": [[["leakyrelu_49", 0, 0]]], "name": "zeropadding2d_44"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_44", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 16, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["zeropadding2d_44", 0, 0]]], "name": "convolution2d_44"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": true, "name": "leakyrelu_50"}, "inbound_nodes": [[["convolution2d_44", 0, 0]]], "name": "leakyrelu_50"}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_19", "trainable": true, "dim_ordering": "th", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}, "inbound_nodes": [[["leakyrelu_50", 0, 0]]], "name": "maxpooling2d_19"}, {"class_name": "Dropout", "config": {"p": 0.1, "trainable": true, "name": "pool4"}, "inbound_nodes": [[["maxpooling2d_19", 0, 0]]], "name": "pool4"}, {"class_name": "ZeroPadding2D", "config": {"padding": [1, 1], "trainable": true, "name": "zeropadding2d_46"}, "inbound_nodes": [[["pool3", 0, 0]]], "name": "zeropadding2d_46"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_46", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 16, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["zeropadding2d_46", 0, 0]]], "name": "convolution2d_46"}, {"class_name": "ZeroPadding2D", "config": {"padding": [1, 1], "trainable": true, "name": "zeropadding2d_45"}, "inbound_nodes": [[["pool4", 0, 0]]], "name": "zeropadding2d_45"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_45", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 16, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["zeropadding2d_45", 0, 0]]], "name": "convolution2d_45"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": true, "name": "leakyrelu_54"}, "inbound_nodes": [[["convolution2d_46", 0, 0]]], "name": "leakyrelu_54"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": true, "name": "leakyrelu_51"}, "inbound_nodes": [[["convolution2d_45", 0, 0]]], "name": "leakyrelu_51"}, {"class_name": "UpSampling2D", "config": {"trainable": true, "name": "upsampling2d_10", "size": [2, 2]}, "inbound_nodes": [[["leakyrelu_54", 0, 0]]], "name": "upsampling2d_10"}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_20", "trainable": true, "dim_ordering": "th", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}, "inbound_nodes": [[["leakyrelu_51", 0, 0]]], "name": "maxpooling2d_20"}, {"class_name": "Merge", "config": {"name": "merge_10", "concat_axis": 1, "mode_type": "raw", "dot_axes": [-1, -1], "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["upsampling2d_10", 0, 0], ["pool2", 0, 0]]], "name": "merge_10"}, {"class_name": "Dropout", "config": {"p": 0.1, "trainable": true, "name": "pool5"}, "inbound_nodes": [[["maxpooling2d_20", 0, 0]]], "name": "pool5"}, {"class_name": "ZeroPadding2D", "config": {"padding": [1, 1], "trainable": true, "name": "zeropadding2d_47"}, "inbound_nodes": [[["merge_10", 0, 0]]], "name": "zeropadding2d_47"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_47", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 16, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["zeropadding2d_47", 0, 0]]], "name": "convolution2d_47"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_4"}, "inbound_nodes": [[["pool5", 0, 0]]], "name": "flatten_4"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_7", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 32}, "inbound_nodes": [[["flatten_4", 0, 0]]], "name": "dense_7"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": true, "name": "leakyrelu_55"}, "inbound_nodes": [[["convolution2d_47", 0, 0]]], "name": "leakyrelu_55"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": true, "name": "leakyrelu_52"}, "inbound_nodes": [[["dense_7", 0, 0]]], "name": "leakyrelu_52"}, {"class_name": "UpSampling2D", "config": {"trainable": true, "name": "upsampling2d_11", "size": [2, 2]}, "inbound_nodes": [[["leakyrelu_55", 0, 0]]], "name": "upsampling2d_11"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_8", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 16}, "inbound_nodes": [[["leakyrelu_52", 0, 0]]], "name": "dense_8"}, {"class_name": "Merge", "config": {"name": "merge_11", "concat_axis": 1, "mode_type": "raw", "dot_axes": [-1, -1], "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["upsampling2d_11", 0, 0], ["pool1", 0, 0]]], "name": "merge_11"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": true, "name": "leakyrelu_53"}, "inbound_nodes": [[["dense_8", 0, 0]]], "name": "leakyrelu_53"}, {"class_name": "ZeroPadding2D", "config": {"padding": [1, 1], "trainable": true, "name": "zeropadding2d_48"}, "inbound_nodes": [[["merge_11", 0, 0]]], "name": "zeropadding2d_48"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_48", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 16, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["zeropadding2d_48", 0, 0]]], "name": "convolution2d_48"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "outbin", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "sigmoid", "output_dim": 1}, "inbound_nodes": [[["leakyrelu_53", 0, 0]]], "name": "outbin"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": true, "name": "leakyrelu_56"}, "inbound_nodes": [[["convolution2d_48", 0, 0]]], "name": "leakyrelu_56"}, {"class_name": "RepeatVector", "config": {"trainable": true, "name": "repeatvector_4", "n": 262144}, "inbound_nodes": [[["outbin", 0, 0]]], "name": "repeatvector_4"}, {"class_name": "Reshape", "config": {"target_shape": [16, 128, 128], "trainable": true, "name": "outbinmap"}, "inbound_nodes": [[["repeatvector_4", 0, 0]]], "name": "outbinmap"}, {"class_name": "UpSampling2D", "config": {"trainable": true, "name": "upsampling2d_12", "size": [2, 2]}, "inbound_nodes": [[["leakyrelu_56", 0, 0]]], "name": "upsampling2d_12"}, {"class_name": "Merge", "config": {"name": "merge_12", "concat_axis": -1, "mode_type": "raw", "dot_axes": [-1, -1], "mode": "mul", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["outbinmap", 0, 0], ["upsampling2d_12", 0, 0]]], "name": "merge_12"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "outmap", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 1, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "sigmoid", "nb_row": 3}, "inbound_nodes": [[["merge_12", 0, 0]]], "name": "outmap"}], "input_layers": [["input_4", 0, 0]], "output_layers": [["outmap", 0, 0], ["outbin", 0, 0]], "name": "model_3"}}