{"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1, 128, 128], "name": "input_9", "input_dtype": "float32"}, "inbound_nodes": [], "name": "input_9"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_61", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 16, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["input_9", 0, 0]]], "name": "convolution2d_61"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": true, "name": "leakyrelu_72"}, "inbound_nodes": [[["convolution2d_61", 0, 0]]], "name": "leakyrelu_72"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_62", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 16, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["leakyrelu_72", 0, 0]]], "name": "convolution2d_62"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": true, "name": "leakyrelu_73"}, "inbound_nodes": [[["convolution2d_62", 0, 0]]], "name": "leakyrelu_73"}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_32", "trainable": true, "dim_ordering": "th", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}, "inbound_nodes": [[["leakyrelu_73", 0, 0]]], "name": "maxpooling2d_32"}, {"class_name": "Dropout", "config": {"p": 0.1, "trainable": true, "name": "pool1"}, "inbound_nodes": [[["maxpooling2d_32", 0, 0]]], "name": "pool1"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_63", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 16, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["pool1", 0, 0]]], "name": "convolution2d_63"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": true, "name": "leakyrelu_74"}, "inbound_nodes": [[["convolution2d_63", 0, 0]]], "name": "leakyrelu_74"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_64", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 16, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["leakyrelu_74", 0, 0]]], "name": "convolution2d_64"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": true, "name": "leakyrelu_75"}, "inbound_nodes": [[["convolution2d_64", 0, 0]]], "name": "leakyrelu_75"}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_33", "trainable": true, "dim_ordering": "th", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}, "inbound_nodes": [[["leakyrelu_75", 0, 0]]], "name": "maxpooling2d_33"}, {"class_name": "Dropout", "config": {"p": 0.1, "trainable": true, "name": "pool2"}, "inbound_nodes": [[["maxpooling2d_33", 0, 0]]], "name": "pool2"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_65", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 16, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["pool2", 0, 0]]], "name": "convolution2d_65"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": true, "name": "leakyrelu_76"}, "inbound_nodes": [[["convolution2d_65", 0, 0]]], "name": "leakyrelu_76"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_66", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 16, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["leakyrelu_76", 0, 0]]], "name": "convolution2d_66"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": true, "name": "leakyrelu_77"}, "inbound_nodes": [[["convolution2d_66", 0, 0]]], "name": "leakyrelu_77"}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_34", "trainable": true, "dim_ordering": "th", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}, "inbound_nodes": [[["leakyrelu_77", 0, 0]]], "name": "maxpooling2d_34"}, {"class_name": "Dropout", "config": {"p": 0.1, "trainable": true, "name": "pool3"}, "inbound_nodes": [[["maxpooling2d_34", 0, 0]]], "name": "pool3"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_67", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 16, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["pool3", 0, 0]]], "name": "convolution2d_67"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": true, "name": "leakyrelu_78"}, "inbound_nodes": [[["convolution2d_67", 0, 0]]], "name": "leakyrelu_78"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_68", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 16, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["leakyrelu_78", 0, 0]]], "name": "convolution2d_68"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": true, "name": "leakyrelu_79"}, "inbound_nodes": [[["convolution2d_68", 0, 0]]], "name": "leakyrelu_79"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": true, "name": "leakyrelu_80"}, "inbound_nodes": [[["leakyrelu_79", 0, 0]]], "name": "leakyrelu_80"}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_35", "trainable": true, "dim_ordering": "th", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}, "inbound_nodes": [[["leakyrelu_80", 0, 0]]], "name": "maxpooling2d_35"}, {"class_name": "Dropout", "config": {"p": 0.1, "trainable": true, "name": "pool4"}, "inbound_nodes": [[["maxpooling2d_35", 0, 0]]], "name": "pool4"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_69", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 16, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["pool4", 0, 0]]], "name": "convolution2d_69"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": true, "name": "leakyrelu_81"}, "inbound_nodes": [[["convolution2d_69", 0, 0]]], "name": "leakyrelu_81"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_70", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 16, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["leakyrelu_81", 0, 0]]], "name": "convolution2d_70"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": true, "name": "leakyrelu_82"}, "inbound_nodes": [[["convolution2d_70", 0, 0]]], "name": "leakyrelu_82"}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_36", "trainable": true, "dim_ordering": "th", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}, "inbound_nodes": [[["leakyrelu_82", 0, 0]]], "name": "maxpooling2d_36"}, {"class_name": "Dropout", "config": {"p": 0.1, "trainable": true, "name": "pool5"}, "inbound_nodes": [[["maxpooling2d_36", 0, 0]]], "name": "pool5"}, {"class_name": "UpSampling2D", "config": {"trainable": true, "name": "upsampling2d_19", "size": [4, 4]}, "inbound_nodes": [[["pool5", 0, 0]]], "name": "upsampling2d_19"}, {"class_name": "UpSampling2D", "config": {"trainable": true, "name": "upsampling2d_20", "size": [2, 2]}, "inbound_nodes": [[["pool4", 0, 0]]], "name": "upsampling2d_20"}, {"class_name": "Merge", "config": {"name": "merge_13", "concat_axis": 1, "mode_type": "raw", "dot_axes": [-1, -1], "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["pool3", 0, 0], ["upsampling2d_20", 0, 0], ["upsampling2d_19", 0, 0]]], "name": "merge_13"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_71", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 16, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["merge_13", 0, 0]]], "name": "convolution2d_71"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": true, "name": "leakyrelu_84"}, "inbound_nodes": [[["convolution2d_71", 0, 0]]], "name": "leakyrelu_84"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_72", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 16, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["leakyrelu_84", 0, 0]]], "name": "convolution2d_72"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": true, "name": "leakyrelu_85"}, "inbound_nodes": [[["convolution2d_72", 0, 0]]], "name": "leakyrelu_85"}, {"class_name": "UpSampling2D", "config": {"trainable": true, "name": "upsampling2d_21", "size": [2, 2]}, "inbound_nodes": [[["leakyrelu_85", 0, 0]]], "name": "upsampling2d_21"}, {"class_name": "Merge", "config": {"name": "merge_14", "concat_axis": 1, "mode_type": "raw", "dot_axes": [-1, -1], "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["upsampling2d_21", 0, 0], ["pool2", 0, 0]]], "name": "merge_14"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_73", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 16, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["merge_14", 0, 0]]], "name": "convolution2d_73"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": true, "name": "leakyrelu_86"}, "inbound_nodes": [[["convolution2d_73", 0, 0]]], "name": "leakyrelu_86"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_74", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 16, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["leakyrelu_86", 0, 0]]], "name": "convolution2d_74"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": true, "name": "leakyrelu_87"}, "inbound_nodes": [[["convolution2d_74", 0, 0]]], "name": "leakyrelu_87"}, {"class_name": "UpSampling2D", "config": {"trainable": true, "name": "upsampling2d_22", "size": [2, 2]}, "inbound_nodes": [[["leakyrelu_87", 0, 0]]], "name": "upsampling2d_22"}, {"class_name": "Merge", "config": {"name": "merge_15", "concat_axis": 1, "mode_type": "raw", "dot_axes": [-1, -1], "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["upsampling2d_22", 0, 0], ["pool1", 0, 0]]], "name": "merge_15"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_75", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 16, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["merge_15", 0, 0]]], "name": "convolution2d_75"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": true, "name": "leakyrelu_88"}, "inbound_nodes": [[["convolution2d_75", 0, 0]]], "name": "leakyrelu_88"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_76", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 16, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["leakyrelu_88", 0, 0]]], "name": "convolution2d_76"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_8"}, "inbound_nodes": [[["pool5", 0, 0]]], "name": "flatten_8"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_11", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 32}, "inbound_nodes": [[["flatten_8", 0, 0]]], "name": "dense_11"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": true, "name": "leakyrelu_89"}, "inbound_nodes": [[["convolution2d_76", 0, 0]]], "name": "leakyrelu_89"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": true, "name": "leakyrelu_83"}, "inbound_nodes": [[["dense_11", 0, 0]]], "name": "leakyrelu_83"}, {"class_name": "UpSampling2D", "config": {"trainable": true, "name": "upsampling2d_23", "size": [2, 2]}, "inbound_nodes": [[["leakyrelu_89", 0, 0]]], "name": "upsampling2d_23"}, {"class_name": "Dropout", "config": {"p": 0.25, "trainable": true, "name": "dropout_4"}, "inbound_nodes": [[["leakyrelu_83", 0, 0]]], "name": "dropout_4"}, {"class_name": "ZeroPadding2D", "config": {"padding": [1, 1], "trainable": true, "name": "zeropadding2d_56"}, "inbound_nodes": [[["upsampling2d_23", 0, 0]]], "name": "zeropadding2d_56"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "outbin", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "sigmoid", "output_dim": 1}, "inbound_nodes": [[["dropout_4", 0, 0]]], "name": "outbin"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "outmap", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 1, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "sigmoid", "nb_row": 3}, "inbound_nodes": [[["zeropadding2d_56", 0, 0]]], "name": "outmap"}], "input_layers": [["input_9", 0, 0]], "output_layers": [["outmap", 0, 0], ["outbin", 0, 0]], "name": "model_6"}}